TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v21.6.0.LTS *
       3              ;* Date/Time created: Thu Jan 20 17:49:12 2022                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v21.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\controlSUITE\development_kits\TMDSIDDK_v1.0\IDDK_PM_Servo_F28
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("GPIO_EnableUnbondedIOPullups")

    1947                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/source/F2837xD_SysCtrl.c"
    1948 000002cd 0200          MOVB      ACC,#0                ; [CPU_ALU] |486| 
    1949 000002ce 1901          SUBB      ACC,#1                ; [CPU_ALU] |486| 
    1950 000002cf 1E12!         MOVL      @$BLOCKED(_DcsmZ1Regs)+18,ACC ; [CPU_ALU] |486| 
    1951                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/source/F2837xD_SysCtrl.c"
    1952 000002d0 0200          MOVB      ACC,#0                ; [CPU_ALU] |487| 
    1953 000002d1 1901          SUBB      ACC,#1                ; [CPU_ALU] |487| 
    1954 000002d2 1E14!         MOVL      @$BLOCKED(_DcsmZ1Regs)+20,ACC ; [CPU_ALU] |487| 
    1955                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/source/F2837xD_SysCtrl.c"
    1956 000002d3 0200          MOVB      ACC,#0                ; [CPU_ALU] |488| 
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   40

    1957 000002d4 1901          SUBB      ACC,#1                ; [CPU_ALU] |488| 
    1958 000002d5 1E16!         MOVL      @$BLOCKED(_DcsmZ1Regs)+22,ACC ; [CPU_ALU] |488| 
    1959                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/source/F2837xD_SysCtrl.c"
    1960 000002d6 0200          MOVB      ACC,#0                ; [CPU_ALU] |490| 
    1961 000002d7 761F!         MOVW      DP,#_DcsmZ2Regs+16    ; [CPU_ARAU] 
         000002d8 0000 
    1962 000002d9 1901          SUBB      ACC,#1                ; [CPU_ALU] |490| 
    1963 000002da 1E10!         MOVL      @$BLOCKED(_DcsmZ2Regs)+16,ACC ; [CPU_ALU] |490| 
    1964                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/source/F2837xD_SysCtrl.c"
    1965 000002db 0200          MOVB      ACC,#0                ; [CPU_ALU] |491| 
    1966 000002dc 1901          SUBB      ACC,#1                ; [CPU_ALU] |491| 
    1967 000002dd 1E12!         MOVL      @$BLOCKED(_DcsmZ2Regs)+18,ACC ; [CPU_ALU] |491| 
    1968                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/source/F2837xD_SysCtrl.c"
    1969 000002de 0200          MOVB      ACC,#0                ; [CPU_ALU] |492| 
    1970 000002df 1901          SUBB      ACC,#1                ; [CPU_ALU] |492| 
    1971 000002e0 1E14!         MOVL      @$BLOCKED(_DcsmZ2Regs)+20,ACC ; [CPU_ALU] |492| 
    1972                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/source/F2837xD_SysCtrl.c"
    1973 000002e1 0200          MOVB      ACC,#0                ; [CPU_ALU] |493| 
    1974 000002e2 1901          SUBB      ACC,#1                ; [CPU_ALU] |493| 
    1975 000002e3 1E16!         MOVL      @$BLOCKED(_DcsmZ2Regs)+22,ACC ; [CPU_ALU] |493| 
    1976 000002e4 761A   EDIS
    1977 000002e5 FF69          SPM       #0                    ; [CPU_ALU] 
    1978                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/source/F2837xD_SysCtrl.c"
    1979 000002e6 9A00          MOVB      AL,#0                 ; [CPU_ALU] |513| 
    1980              $C$DW$79        .dwtag  DW_TAG_TI_branch
    1981                      .dwattr $C$DW$79, DW_AT_low_pc(0x00)
    1982                      .dwattr $C$DW$79, DW_AT_TI_return
    1983              
    1984 000002e7 0006          LRETR     ; [CPU_ALU] 
    1985                      ; return occurs ; [] 
    1986                      .dwattr $C$DW$78, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/so
    1987                      .dwattr $C$DW$78, DW_AT_TI_end_line(0x203)
    1988                      .dwattr $C$DW$78, DW_AT_TI_end_column(0x01)
    1989                      .dwendentry
    1990                      .dwendtag $C$DW$78
    1991              
    1992              ;**************************************************************
    1993              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1994              ;**************************************************************
    1995                      .global _GPIO_EnableUnbondedIOPullups
    1996                      .global _F28x_usDelay
    1997                      .global _DcsmZ1Regs
    1998                      .global _DcsmZ2Regs
    1999                      .global _Flash0EccRegs
    2000                      .global _WdRegs
    2001                      .global _ClkCfgRegs
    2002                      .global _AnalogSubsysRegs
    2003                      .global _CpuSysRegs
    2004                      .global _DevCfgRegs
    2005                      .global _Flash0CtrlRegs
    2006              
    2007              ;***************************************************************
    2008              ;* TYPE INFORMATION                                            *
    2009              ;***************************************************************
    2010              
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   41

    2011              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2012                      .dwattr $C$DW$T$25, DW_AT_name("ANALOG_SUBSYS_REGS")
    2013                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x48)
    2014              $C$DW$80        .dwtag  DW_TAG_member
    2015                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
    2016                      .dwattr $C$DW$80, DW_AT_name("rsvd1")
    2017                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_rsvd1")
    2018                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    2020              
    2021              $C$DW$81        .dwtag  DW_TAG_member
    2022                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$194)
    2023                      .dwattr $C$DW$81, DW_AT_name("INTOSC1TRIM")
    2024                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_INTOSC1TRIM")
    2025                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2026                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    2027              
    2028              $C$DW$82        .dwtag  DW_TAG_member
    2029                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$196)
    2030                      .dwattr $C$DW$82, DW_AT_name("INTOSC2TRIM")
    2031                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_INTOSC2TRIM")
    2032                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2033                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    2034              
    2035              $C$DW$83        .dwtag  DW_TAG_member
    2036                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
    2037                      .dwattr $C$DW$83, DW_AT_name("rsvd2")
    2038                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd2")
    2039                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2040                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    2041              
    2042              $C$DW$84        .dwtag  DW_TAG_member
    2043                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$296)
    2044                      .dwattr $C$DW$84, DW_AT_name("TSNSCTL")
    2045                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_TSNSCTL")
    2046                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2047                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    2048              
    2049              $C$DW$85        .dwtag  DW_TAG_member
    2050                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$22)
    2051                      .dwattr $C$DW$85, DW_AT_name("rsvd3")
    2052                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_rsvd3")
    2053                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    2054                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    2055              
    2056              $C$DW$86        .dwtag  DW_TAG_member
    2057                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$200)
    2058                      .dwattr $C$DW$86, DW_AT_name("LOCK")
    2059                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_LOCK")
    2060                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2061                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    2062              
    2063              $C$DW$87        .dwtag  DW_TAG_member
    2064                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$23)
    2065                      .dwattr $C$DW$87, DW_AT_name("rsvd4")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   42

    2066                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd4")
    2067                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2068                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    2069              
    2070              $C$DW$88        .dwtag  DW_TAG_member
    2071                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$28)
    2072                      .dwattr $C$DW$88, DW_AT_name("ANAREFTRIMA")
    2073                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ANAREFTRIMA")
    2074                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2075                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2076              
    2077              $C$DW$89        .dwtag  DW_TAG_member
    2078                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$30)
    2079                      .dwattr $C$DW$89, DW_AT_name("ANAREFTRIMB")
    2080                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ANAREFTRIMB")
    2081                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2082                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2083              
    2084              $C$DW$90        .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$32)
    2086                      .dwattr $C$DW$90, DW_AT_name("ANAREFTRIMC")
    2087                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_ANAREFTRIMC")
    2088                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    2089                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2090              
    2091              $C$DW$91        .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$34)
    2093                      .dwattr $C$DW$91, DW_AT_name("ANAREFTRIMD")
    2094                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ANAREFTRIMD")
    2095                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2096                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2097              
    2098              $C$DW$92        .dwtag  DW_TAG_member
    2099                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$24)
    2100                      .dwattr $C$DW$92, DW_AT_name("rsvd5")
    2101                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_rsvd5")
    2102                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    2103                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2104              
    2105                      .dwendtag $C$DW$T$25
    2106              
    2107              $C$DW$93        .dwtag  DW_TAG_TI_far_type
    2108                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$25)
    2109              
    2110              $C$DW$T$344     .dwtag  DW_TAG_volatile_type
    2111                      .dwattr $C$DW$T$344, DW_AT_type(*$C$DW$93)
    2112              
    2113              
    2114              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2115                      .dwattr $C$DW$T$26, DW_AT_name("ANAREFTRIMA_BITS")
    2116                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    2117              $C$DW$94        .dwtag  DW_TAG_member
    2118                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    2119                      .dwattr $C$DW$94, DW_AT_name("BGVALTRIM")
    2120                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_BGVALTRIM")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   43

    2121                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0a)
    2122                      .dwattr $C$DW$94, DW_AT_bit_size(0x06)
    2123                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2124                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2125              
    2126              $C$DW$95        .dwtag  DW_TAG_member
    2127                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    2128                      .dwattr $C$DW$95, DW_AT_name("BGSLOPETRIM")
    2129                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2130                      .dwattr $C$DW$95, DW_AT_bit_offset(0x05)
    2131                      .dwattr $C$DW$95, DW_AT_bit_size(0x05)
    2132                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2133                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2134              
    2135              $C$DW$96        .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    2137                      .dwattr $C$DW$96, DW_AT_name("IREFTRIM")
    2138                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_IREFTRIM")
    2139                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00)
    2140                      .dwattr $C$DW$96, DW_AT_bit_size(0x05)
    2141                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2142                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2143              
    2144              $C$DW$97        .dwtag  DW_TAG_member
    2145                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    2146                      .dwattr $C$DW$97, DW_AT_name("rsvd1")
    2147                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_rsvd1")
    2148                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08)
    2149                      .dwattr $C$DW$97, DW_AT_bit_size(0x08)
    2150                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2151                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2152              
    2153              $C$DW$98        .dwtag  DW_TAG_member
    2154                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    2155                      .dwattr $C$DW$98, DW_AT_name("rsvd2")
    2156                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd2")
    2157                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00)
    2158                      .dwattr $C$DW$98, DW_AT_bit_size(0x08)
    2159                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2160                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2161              
    2162                      .dwendtag $C$DW$T$26
    2163              
    2164              
    2165              $C$DW$T$28      .dwtag  DW_TAG_union_type
    2166                      .dwattr $C$DW$T$28, DW_AT_name("ANAREFTRIMA_REG")
    2167                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2168              $C$DW$99        .dwtag  DW_TAG_member
    2169                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$27)
    2170                      .dwattr $C$DW$99, DW_AT_name("all")
    2171                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_all")
    2172                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2173                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2174              
    2175              $C$DW$100       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   44

    2176                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$26)
    2177                      .dwattr $C$DW$100, DW_AT_name("bit")
    2178                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_bit")
    2179                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2180                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2181              
    2182                      .dwendtag $C$DW$T$28
    2183              
    2184              
    2185              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2186                      .dwattr $C$DW$T$29, DW_AT_name("ANAREFTRIMB_BITS")
    2187                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    2188              $C$DW$101       .dwtag  DW_TAG_member
    2189                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2190                      .dwattr $C$DW$101, DW_AT_name("BGVALTRIM")
    2191                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_BGVALTRIM")
    2192                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0a)
    2193                      .dwattr $C$DW$101, DW_AT_bit_size(0x06)
    2194                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2195                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2196              
    2197              $C$DW$102       .dwtag  DW_TAG_member
    2198                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    2199                      .dwattr $C$DW$102, DW_AT_name("BGSLOPETRIM")
    2200                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2201                      .dwattr $C$DW$102, DW_AT_bit_offset(0x05)
    2202                      .dwattr $C$DW$102, DW_AT_bit_size(0x05)
    2203                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2204                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2205              
    2206              $C$DW$103       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    2208                      .dwattr $C$DW$103, DW_AT_name("IREFTRIM")
    2209                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_IREFTRIM")
    2210                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00)
    2211                      .dwattr $C$DW$103, DW_AT_bit_size(0x05)
    2212                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2213                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2214              
    2215              $C$DW$104       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2217                      .dwattr $C$DW$104, DW_AT_name("rsvd1")
    2218                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd1")
    2219                      .dwattr $C$DW$104, DW_AT_bit_offset(0x08)
    2220                      .dwattr $C$DW$104, DW_AT_bit_size(0x08)
    2221                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2222                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2223              
    2224              $C$DW$105       .dwtag  DW_TAG_member
    2225                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2226                      .dwattr $C$DW$105, DW_AT_name("rsvd2")
    2227                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd2")
    2228                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00)
    2229                      .dwattr $C$DW$105, DW_AT_bit_size(0x08)
    2230                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   45

    2231                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2232              
    2233                      .dwendtag $C$DW$T$29
    2234              
    2235              
    2236              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2237                      .dwattr $C$DW$T$30, DW_AT_name("ANAREFTRIMB_REG")
    2238                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2239              $C$DW$106       .dwtag  DW_TAG_member
    2240                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$27)
    2241                      .dwattr $C$DW$106, DW_AT_name("all")
    2242                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    2243                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2244                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2245              
    2246              $C$DW$107       .dwtag  DW_TAG_member
    2247                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$29)
    2248                      .dwattr $C$DW$107, DW_AT_name("bit")
    2249                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    2250                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2251                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2252              
    2253                      .dwendtag $C$DW$T$30
    2254              
    2255              
    2256              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2257                      .dwattr $C$DW$T$31, DW_AT_name("ANAREFTRIMC_BITS")
    2258                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2259              $C$DW$108       .dwtag  DW_TAG_member
    2260                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    2261                      .dwattr $C$DW$108, DW_AT_name("BGVALTRIM")
    2262                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_BGVALTRIM")
    2263                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0a)
    2264                      .dwattr $C$DW$108, DW_AT_bit_size(0x06)
    2265                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2266                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2267              
    2268              $C$DW$109       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2270                      .dwattr $C$DW$109, DW_AT_name("BGSLOPETRIM")
    2271                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2272                      .dwattr $C$DW$109, DW_AT_bit_offset(0x05)
    2273                      .dwattr $C$DW$109, DW_AT_bit_size(0x05)
    2274                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2275                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2276              
    2277              $C$DW$110       .dwtag  DW_TAG_member
    2278                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2279                      .dwattr $C$DW$110, DW_AT_name("IREFTRIM")
    2280                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_IREFTRIM")
    2281                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    2282                      .dwattr $C$DW$110, DW_AT_bit_size(0x05)
    2283                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2284                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2285              
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   46

    2286              $C$DW$111       .dwtag  DW_TAG_member
    2287                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2288                      .dwattr $C$DW$111, DW_AT_name("rsvd1")
    2289                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_rsvd1")
    2290                      .dwattr $C$DW$111, DW_AT_bit_offset(0x08)
    2291                      .dwattr $C$DW$111, DW_AT_bit_size(0x08)
    2292                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2293                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2294              
    2295              $C$DW$112       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2297                      .dwattr $C$DW$112, DW_AT_name("rsvd2")
    2298                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_rsvd2")
    2299                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00)
    2300                      .dwattr $C$DW$112, DW_AT_bit_size(0x08)
    2301                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2302                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2303              
    2304                      .dwendtag $C$DW$T$31
    2305              
    2306              
    2307              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2308                      .dwattr $C$DW$T$32, DW_AT_name("ANAREFTRIMC_REG")
    2309                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2310              $C$DW$113       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$27)
    2312                      .dwattr $C$DW$113, DW_AT_name("all")
    2313                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_all")
    2314                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2315                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2316              
    2317              $C$DW$114       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$31)
    2319                      .dwattr $C$DW$114, DW_AT_name("bit")
    2320                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_bit")
    2321                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2322                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2323              
    2324                      .dwendtag $C$DW$T$32
    2325              
    2326              
    2327              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2328                      .dwattr $C$DW$T$33, DW_AT_name("ANAREFTRIMD_BITS")
    2329                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2330              $C$DW$115       .dwtag  DW_TAG_member
    2331                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2332                      .dwattr $C$DW$115, DW_AT_name("BGVALTRIM")
    2333                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_BGVALTRIM")
    2334                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0a)
    2335                      .dwattr $C$DW$115, DW_AT_bit_size(0x06)
    2336                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2337                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2338              
    2339              $C$DW$116       .dwtag  DW_TAG_member
    2340                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   47

    2341                      .dwattr $C$DW$116, DW_AT_name("BGSLOPETRIM")
    2342                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_BGSLOPETRIM")
    2343                      .dwattr $C$DW$116, DW_AT_bit_offset(0x05)
    2344                      .dwattr $C$DW$116, DW_AT_bit_size(0x05)
    2345                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2346                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2347              
    2348              $C$DW$117       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2350                      .dwattr $C$DW$117, DW_AT_name("IREFTRIM")
    2351                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_IREFTRIM")
    2352                      .dwattr $C$DW$117, DW_AT_bit_offset(0x00)
    2353                      .dwattr $C$DW$117, DW_AT_bit_size(0x05)
    2354                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2355                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2356              
    2357              $C$DW$118       .dwtag  DW_TAG_member
    2358                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2359                      .dwattr $C$DW$118, DW_AT_name("rsvd1")
    2360                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd1")
    2361                      .dwattr $C$DW$118, DW_AT_bit_offset(0x08)
    2362                      .dwattr $C$DW$118, DW_AT_bit_size(0x08)
    2363                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2364                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2365              
    2366              $C$DW$119       .dwtag  DW_TAG_member
    2367                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2368                      .dwattr $C$DW$119, DW_AT_name("rsvd2")
    2369                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd2")
    2370                      .dwattr $C$DW$119, DW_AT_bit_offset(0x00)
    2371                      .dwattr $C$DW$119, DW_AT_bit_size(0x08)
    2372                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2373                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2374              
    2375                      .dwendtag $C$DW$T$33
    2376              
    2377              
    2378              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2379                      .dwattr $C$DW$T$34, DW_AT_name("ANAREFTRIMD_REG")
    2380                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2381              $C$DW$120       .dwtag  DW_TAG_member
    2382                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$27)
    2383                      .dwattr $C$DW$120, DW_AT_name("all")
    2384                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_all")
    2385                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2386                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2387              
    2388              $C$DW$121       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$33)
    2390                      .dwattr $C$DW$121, DW_AT_name("bit")
    2391                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_bit")
    2392                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2393                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2394              
    2395                      .dwendtag $C$DW$T$34
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   48

    2396              
    2397              
    2398              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2399                      .dwattr $C$DW$T$35, DW_AT_name("AUXCLKDIVSEL_BITS")
    2400                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2401              $C$DW$122       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2403                      .dwattr $C$DW$122, DW_AT_name("AUXPLLDIV")
    2404                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_AUXPLLDIV")
    2405                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e)
    2406                      .dwattr $C$DW$122, DW_AT_bit_size(0x02)
    2407                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2409              
    2410              $C$DW$123       .dwtag  DW_TAG_member
    2411                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2412                      .dwattr $C$DW$123, DW_AT_name("rsvd1")
    2413                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd1")
    2414                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00)
    2415                      .dwattr $C$DW$123, DW_AT_bit_size(0x0e)
    2416                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2417                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2418              
    2419              $C$DW$124       .dwtag  DW_TAG_member
    2420                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2421                      .dwattr $C$DW$124, DW_AT_name("rsvd2")
    2422                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_rsvd2")
    2423                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00)
    2424                      .dwattr $C$DW$124, DW_AT_bit_size(0x10)
    2425                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2426                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2427              
    2428                      .dwendtag $C$DW$T$35
    2429              
    2430              
    2431              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2432                      .dwattr $C$DW$T$36, DW_AT_name("AUXCLKDIVSEL_REG")
    2433                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2434              $C$DW$125       .dwtag  DW_TAG_member
    2435                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$27)
    2436                      .dwattr $C$DW$125, DW_AT_name("all")
    2437                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    2438                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2439                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2440              
    2441              $C$DW$126       .dwtag  DW_TAG_member
    2442                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$35)
    2443                      .dwattr $C$DW$126, DW_AT_name("bit")
    2444                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    2445                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2446                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2447              
    2448                      .dwendtag $C$DW$T$36
    2449              
    2450              
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   49

    2451              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2452                      .dwattr $C$DW$T$37, DW_AT_name("AUXPLLCTL1_BITS")
    2453                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2454              $C$DW$127       .dwtag  DW_TAG_member
    2455                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2456                      .dwattr $C$DW$127, DW_AT_name("PLLEN")
    2457                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_PLLEN")
    2458                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0f)
    2459                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    2460                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2461                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2462              
    2463              $C$DW$128       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2465                      .dwattr $C$DW$128, DW_AT_name("PLLCLKEN")
    2466                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_PLLCLKEN")
    2467                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0e)
    2468                      .dwattr $C$DW$128, DW_AT_bit_size(0x01)
    2469                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2470                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2471              
    2472              $C$DW$129       .dwtag  DW_TAG_member
    2473                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2474                      .dwattr $C$DW$129, DW_AT_name("rsvd1")
    2475                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd1")
    2476                      .dwattr $C$DW$129, DW_AT_bit_offset(0x00)
    2477                      .dwattr $C$DW$129, DW_AT_bit_size(0x0e)
    2478                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2479                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2480              
    2481              $C$DW$130       .dwtag  DW_TAG_member
    2482                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2483                      .dwattr $C$DW$130, DW_AT_name("rsvd2")
    2484                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd2")
    2485                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    2486                      .dwattr $C$DW$130, DW_AT_bit_size(0x10)
    2487                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2488                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2489              
    2490                      .dwendtag $C$DW$T$37
    2491              
    2492              
    2493              $C$DW$T$38      .dwtag  DW_TAG_union_type
    2494                      .dwattr $C$DW$T$38, DW_AT_name("AUXPLLCTL1_REG")
    2495                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2496              $C$DW$131       .dwtag  DW_TAG_member
    2497                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$27)
    2498                      .dwattr $C$DW$131, DW_AT_name("all")
    2499                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    2500                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2501                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2502              
    2503              $C$DW$132       .dwtag  DW_TAG_member
    2504                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$37)
    2505                      .dwattr $C$DW$132, DW_AT_name("bit")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   50

    2506                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    2507                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2508                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2509              
    2510                      .dwendtag $C$DW$T$38
    2511              
    2512              
    2513              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2514                      .dwattr $C$DW$T$39, DW_AT_name("AUXPLLMULT_BITS")
    2515                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    2516              $C$DW$133       .dwtag  DW_TAG_member
    2517                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2518                      .dwattr $C$DW$133, DW_AT_name("IMULT")
    2519                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_IMULT")
    2520                      .dwattr $C$DW$133, DW_AT_bit_offset(0x09)
    2521                      .dwattr $C$DW$133, DW_AT_bit_size(0x07)
    2522                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2523                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2524              
    2525              $C$DW$134       .dwtag  DW_TAG_member
    2526                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2527                      .dwattr $C$DW$134, DW_AT_name("rsvd1")
    2528                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd1")
    2529                      .dwattr $C$DW$134, DW_AT_bit_offset(0x08)
    2530                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
    2531                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2532                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2533              
    2534              $C$DW$135       .dwtag  DW_TAG_member
    2535                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2536                      .dwattr $C$DW$135, DW_AT_name("FMULT")
    2537                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_FMULT")
    2538                      .dwattr $C$DW$135, DW_AT_bit_offset(0x06)
    2539                      .dwattr $C$DW$135, DW_AT_bit_size(0x02)
    2540                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2541                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2542              
    2543              $C$DW$136       .dwtag  DW_TAG_member
    2544                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2545                      .dwattr $C$DW$136, DW_AT_name("rsvd2")
    2546                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_rsvd2")
    2547                      .dwattr $C$DW$136, DW_AT_bit_offset(0x00)
    2548                      .dwattr $C$DW$136, DW_AT_bit_size(0x06)
    2549                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2550                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2551              
    2552              $C$DW$137       .dwtag  DW_TAG_member
    2553                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2554                      .dwattr $C$DW$137, DW_AT_name("rsvd3")
    2555                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_rsvd3")
    2556                      .dwattr $C$DW$137, DW_AT_bit_offset(0x00)
    2557                      .dwattr $C$DW$137, DW_AT_bit_size(0x10)
    2558                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2559                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2560              
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   51

    2561                      .dwendtag $C$DW$T$39
    2562              
    2563              
    2564              $C$DW$T$40      .dwtag  DW_TAG_union_type
    2565                      .dwattr $C$DW$T$40, DW_AT_name("AUXPLLMULT_REG")
    2566                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2567              $C$DW$138       .dwtag  DW_TAG_member
    2568                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$27)
    2569                      .dwattr $C$DW$138, DW_AT_name("all")
    2570                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_all")
    2571                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2572                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2573              
    2574              $C$DW$139       .dwtag  DW_TAG_member
    2575                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$39)
    2576                      .dwattr $C$DW$139, DW_AT_name("bit")
    2577                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_bit")
    2578                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2579                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2580              
    2581                      .dwendtag $C$DW$T$40
    2582              
    2583              
    2584              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2585                      .dwattr $C$DW$T$41, DW_AT_name("AUXPLLSTS_BITS")
    2586                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    2587              $C$DW$140       .dwtag  DW_TAG_member
    2588                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    2589                      .dwattr $C$DW$140, DW_AT_name("LOCKS")
    2590                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_LOCKS")
    2591                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0f)
    2592                      .dwattr $C$DW$140, DW_AT_bit_size(0x01)
    2593                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2594                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2595              
    2596              $C$DW$141       .dwtag  DW_TAG_member
    2597                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2598                      .dwattr $C$DW$141, DW_AT_name("SLIPS")
    2599                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_SLIPS")
    2600                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0e)
    2601                      .dwattr $C$DW$141, DW_AT_bit_size(0x01)
    2602                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2603                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2604              
    2605              $C$DW$142       .dwtag  DW_TAG_member
    2606                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2607                      .dwattr $C$DW$142, DW_AT_name("rsvd1")
    2608                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd1")
    2609                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00)
    2610                      .dwattr $C$DW$142, DW_AT_bit_size(0x0e)
    2611                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2612                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2613              
    2614              $C$DW$143       .dwtag  DW_TAG_member
    2615                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   52

    2616                      .dwattr $C$DW$143, DW_AT_name("rsvd2")
    2617                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd2")
    2618                      .dwattr $C$DW$143, DW_AT_bit_offset(0x00)
    2619                      .dwattr $C$DW$143, DW_AT_bit_size(0x10)
    2620                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2621                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2622              
    2623                      .dwendtag $C$DW$T$41
    2624              
    2625              
    2626              $C$DW$T$42      .dwtag  DW_TAG_union_type
    2627                      .dwattr $C$DW$T$42, DW_AT_name("AUXPLLSTS_REG")
    2628                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    2629              $C$DW$144       .dwtag  DW_TAG_member
    2630                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    2631                      .dwattr $C$DW$144, DW_AT_name("all")
    2632                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_all")
    2633                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2634                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2635              
    2636              $C$DW$145       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$41)
    2638                      .dwattr $C$DW$145, DW_AT_name("bit")
    2639                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_bit")
    2640                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2641                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2642              
    2643                      .dwendtag $C$DW$T$42
    2644              
    2645              
    2646              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2647                      .dwattr $C$DW$T$43, DW_AT_name("CLKCFGLOCK1_BITS")
    2648                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x02)
    2649              $C$DW$146       .dwtag  DW_TAG_member
    2650                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2651                      .dwattr $C$DW$146, DW_AT_name("CLKSRCCTL1")
    2652                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    2653                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0f)
    2654                      .dwattr $C$DW$146, DW_AT_bit_size(0x01)
    2655                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2656                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2657              
    2658              $C$DW$147       .dwtag  DW_TAG_member
    2659                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2660                      .dwattr $C$DW$147, DW_AT_name("CLKSRCCTL2")
    2661                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    2662                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0e)
    2663                      .dwattr $C$DW$147, DW_AT_bit_size(0x01)
    2664                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2665                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2666              
    2667              $C$DW$148       .dwtag  DW_TAG_member
    2668                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2669                      .dwattr $C$DW$148, DW_AT_name("CLKSRCCTL3")
    2670                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_CLKSRCCTL3")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   53

    2671                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0d)
    2672                      .dwattr $C$DW$148, DW_AT_bit_size(0x01)
    2673                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2674                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2675              
    2676              $C$DW$149       .dwtag  DW_TAG_member
    2677                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2678                      .dwattr $C$DW$149, DW_AT_name("SYSPLLCTL1")
    2679                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    2680                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0c)
    2681                      .dwattr $C$DW$149, DW_AT_bit_size(0x01)
    2682                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2683                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2684              
    2685              $C$DW$150       .dwtag  DW_TAG_member
    2686                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2687                      .dwattr $C$DW$150, DW_AT_name("SYSPLLCTL2")
    2688                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_SYSPLLCTL2")
    2689                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0b)
    2690                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2691                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2692                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2693              
    2694              $C$DW$151       .dwtag  DW_TAG_member
    2695                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2696                      .dwattr $C$DW$151, DW_AT_name("SYSPLLCTL3")
    2697                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_SYSPLLCTL3")
    2698                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0a)
    2699                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2700                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2701                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2702              
    2703              $C$DW$152       .dwtag  DW_TAG_member
    2704                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2705                      .dwattr $C$DW$152, DW_AT_name("SYSPLLMULT")
    2706                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_SYSPLLMULT")
    2707                      .dwattr $C$DW$152, DW_AT_bit_offset(0x09)
    2708                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2709                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2710                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2711              
    2712              $C$DW$153       .dwtag  DW_TAG_member
    2713                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2714                      .dwattr $C$DW$153, DW_AT_name("AUXPLLCTL1")
    2715                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    2716                      .dwattr $C$DW$153, DW_AT_bit_offset(0x08)
    2717                      .dwattr $C$DW$153, DW_AT_bit_size(0x01)
    2718                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2719                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2720              
    2721              $C$DW$154       .dwtag  DW_TAG_member
    2722                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2723                      .dwattr $C$DW$154, DW_AT_name("rsvd1")
    2724                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_rsvd1")
    2725                      .dwattr $C$DW$154, DW_AT_bit_offset(0x07)
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   54

    2726                      .dwattr $C$DW$154, DW_AT_bit_size(0x01)
    2727                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2728                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2729              
    2730              $C$DW$155       .dwtag  DW_TAG_member
    2731                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2732                      .dwattr $C$DW$155, DW_AT_name("rsvd2")
    2733                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_rsvd2")
    2734                      .dwattr $C$DW$155, DW_AT_bit_offset(0x06)
    2735                      .dwattr $C$DW$155, DW_AT_bit_size(0x01)
    2736                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2737                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2738              
    2739              $C$DW$156       .dwtag  DW_TAG_member
    2740                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2741                      .dwattr $C$DW$156, DW_AT_name("AUXPLLMULT")
    2742                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_AUXPLLMULT")
    2743                      .dwattr $C$DW$156, DW_AT_bit_offset(0x05)
    2744                      .dwattr $C$DW$156, DW_AT_bit_size(0x01)
    2745                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2746                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2747              
    2748              $C$DW$157       .dwtag  DW_TAG_member
    2749                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2750                      .dwattr $C$DW$157, DW_AT_name("SYSCLKDIVSEL")
    2751                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    2752                      .dwattr $C$DW$157, DW_AT_bit_offset(0x04)
    2753                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2754                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2755                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2756              
    2757              $C$DW$158       .dwtag  DW_TAG_member
    2758                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2759                      .dwattr $C$DW$158, DW_AT_name("AUXCLKDIVSEL")
    2760                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
    2761                      .dwattr $C$DW$158, DW_AT_bit_offset(0x03)
    2762                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2763                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2764                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2765              
    2766              $C$DW$159       .dwtag  DW_TAG_member
    2767                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2768                      .dwattr $C$DW$159, DW_AT_name("PERCLKDIVSEL")
    2769                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    2770                      .dwattr $C$DW$159, DW_AT_bit_offset(0x02)
    2771                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2772                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2773                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2774              
    2775              $C$DW$160       .dwtag  DW_TAG_member
    2776                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2777                      .dwattr $C$DW$160, DW_AT_name("rsvd3")
    2778                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_rsvd3")
    2779                      .dwattr $C$DW$160, DW_AT_bit_offset(0x01)
    2780                      .dwattr $C$DW$160, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   55

    2781                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2782                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2783              
    2784              $C$DW$161       .dwtag  DW_TAG_member
    2785                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2786                      .dwattr $C$DW$161, DW_AT_name("LOSPCP")
    2787                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_LOSPCP")
    2788                      .dwattr $C$DW$161, DW_AT_bit_offset(0x00)
    2789                      .dwattr $C$DW$161, DW_AT_bit_size(0x01)
    2790                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2791                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2792              
    2793              $C$DW$162       .dwtag  DW_TAG_member
    2794                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2795                      .dwattr $C$DW$162, DW_AT_name("rsvd4")
    2796                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd4")
    2797                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00)
    2798                      .dwattr $C$DW$162, DW_AT_bit_size(0x10)
    2799                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2800                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2801              
    2802                      .dwendtag $C$DW$T$43
    2803              
    2804              
    2805              $C$DW$T$44      .dwtag  DW_TAG_union_type
    2806                      .dwattr $C$DW$T$44, DW_AT_name("CLKCFGLOCK1_REG")
    2807                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2808              $C$DW$163       .dwtag  DW_TAG_member
    2809                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$27)
    2810                      .dwattr $C$DW$163, DW_AT_name("all")
    2811                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_all")
    2812                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2813                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2814              
    2815              $C$DW$164       .dwtag  DW_TAG_member
    2816                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$43)
    2817                      .dwattr $C$DW$164, DW_AT_name("bit")
    2818                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_bit")
    2819                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2820                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2821              
    2822                      .dwendtag $C$DW$T$44
    2823              
    2824              
    2825              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2826                      .dwattr $C$DW$T$45, DW_AT_name("CLKSEM_BITS")
    2827                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    2828              $C$DW$165       .dwtag  DW_TAG_member
    2829                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2830                      .dwattr $C$DW$165, DW_AT_name("SEM")
    2831                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_SEM")
    2832                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0e)
    2833                      .dwattr $C$DW$165, DW_AT_bit_size(0x02)
    2834                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2835                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   56

    2836              
    2837              $C$DW$166       .dwtag  DW_TAG_member
    2838                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2839                      .dwattr $C$DW$166, DW_AT_name("rsvd1")
    2840                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd1")
    2841                      .dwattr $C$DW$166, DW_AT_bit_offset(0x00)
    2842                      .dwattr $C$DW$166, DW_AT_bit_size(0x0e)
    2843                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2844                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2845              
    2846              $C$DW$167       .dwtag  DW_TAG_member
    2847                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2848                      .dwattr $C$DW$167, DW_AT_name("KEY")
    2849                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_KEY")
    2850                      .dwattr $C$DW$167, DW_AT_bit_offset(0x00)
    2851                      .dwattr $C$DW$167, DW_AT_bit_size(0x10)
    2852                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2853                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2854              
    2855                      .dwendtag $C$DW$T$45
    2856              
    2857              
    2858              $C$DW$T$46      .dwtag  DW_TAG_union_type
    2859                      .dwattr $C$DW$T$46, DW_AT_name("CLKSEM_REG")
    2860                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    2861              $C$DW$168       .dwtag  DW_TAG_member
    2862                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$27)
    2863                      .dwattr $C$DW$168, DW_AT_name("all")
    2864                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_all")
    2865                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2866                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2867              
    2868              $C$DW$169       .dwtag  DW_TAG_member
    2869                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$45)
    2870                      .dwattr $C$DW$169, DW_AT_name("bit")
    2871                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_bit")
    2872                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2873                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2874              
    2875                      .dwendtag $C$DW$T$46
    2876              
    2877              
    2878              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2879                      .dwattr $C$DW$T$47, DW_AT_name("CLKSRCCTL1_BITS")
    2880                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    2881              $C$DW$170       .dwtag  DW_TAG_member
    2882                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2883                      .dwattr $C$DW$170, DW_AT_name("OSCCLKSRCSEL")
    2884                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_OSCCLKSRCSEL")
    2885                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0e)
    2886                      .dwattr $C$DW$170, DW_AT_bit_size(0x02)
    2887                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2888                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2889              
    2890              $C$DW$171       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   57

    2891                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2892                      .dwattr $C$DW$171, DW_AT_name("rsvd1")
    2893                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd1")
    2894                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0d)
    2895                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2896                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2897                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2898              
    2899              $C$DW$172       .dwtag  DW_TAG_member
    2900                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2901                      .dwattr $C$DW$172, DW_AT_name("INTOSC2OFF")
    2902                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_INTOSC2OFF")
    2903                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0c)
    2904                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2905                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2906                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2907              
    2908              $C$DW$173       .dwtag  DW_TAG_member
    2909                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2910                      .dwattr $C$DW$173, DW_AT_name("XTALOFF")
    2911                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_XTALOFF")
    2912                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0b)
    2913                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2914                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2915                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2916              
    2917              $C$DW$174       .dwtag  DW_TAG_member
    2918                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2919                      .dwattr $C$DW$174, DW_AT_name("WDHALTI")
    2920                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_WDHALTI")
    2921                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0a)
    2922                      .dwattr $C$DW$174, DW_AT_bit_size(0x01)
    2923                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2924                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2925              
    2926              $C$DW$175       .dwtag  DW_TAG_member
    2927                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2928                      .dwattr $C$DW$175, DW_AT_name("rsvd2")
    2929                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd2")
    2930                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00)
    2931                      .dwattr $C$DW$175, DW_AT_bit_size(0x0a)
    2932                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2933                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2934              
    2935              $C$DW$176       .dwtag  DW_TAG_member
    2936                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2937                      .dwattr $C$DW$176, DW_AT_name("rsvd3")
    2938                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd3")
    2939                      .dwattr $C$DW$176, DW_AT_bit_offset(0x00)
    2940                      .dwattr $C$DW$176, DW_AT_bit_size(0x10)
    2941                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2942                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2943              
    2944                      .dwendtag $C$DW$T$47
    2945              
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   58

    2946              
    2947              $C$DW$T$48      .dwtag  DW_TAG_union_type
    2948                      .dwattr $C$DW$T$48, DW_AT_name("CLKSRCCTL1_REG")
    2949                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    2950              $C$DW$177       .dwtag  DW_TAG_member
    2951                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$27)
    2952                      .dwattr $C$DW$177, DW_AT_name("all")
    2953                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_all")
    2954                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2955                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2956              
    2957              $C$DW$178       .dwtag  DW_TAG_member
    2958                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$47)
    2959                      .dwattr $C$DW$178, DW_AT_name("bit")
    2960                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_bit")
    2961                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2962                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2963              
    2964                      .dwendtag $C$DW$T$48
    2965              
    2966              
    2967              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    2968                      .dwattr $C$DW$T$49, DW_AT_name("CLKSRCCTL2_BITS")
    2969                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x02)
    2970              $C$DW$179       .dwtag  DW_TAG_member
    2971                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2972                      .dwattr $C$DW$179, DW_AT_name("AUXOSCCLKSRCSEL")
    2973                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_AUXOSCCLKSRCSEL")
    2974                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0e)
    2975                      .dwattr $C$DW$179, DW_AT_bit_size(0x02)
    2976                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2977                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2978              
    2979              $C$DW$180       .dwtag  DW_TAG_member
    2980                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2981                      .dwattr $C$DW$180, DW_AT_name("CANABCLKSEL")
    2982                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_CANABCLKSEL")
    2983                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0c)
    2984                      .dwattr $C$DW$180, DW_AT_bit_size(0x02)
    2985                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2986                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2987              
    2988              $C$DW$181       .dwtag  DW_TAG_member
    2989                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2990                      .dwattr $C$DW$181, DW_AT_name("CANBBCLKSEL")
    2991                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_CANBBCLKSEL")
    2992                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0a)
    2993                      .dwattr $C$DW$181, DW_AT_bit_size(0x02)
    2994                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2995                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2996              
    2997              $C$DW$182       .dwtag  DW_TAG_member
    2998                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2999                      .dwattr $C$DW$182, DW_AT_name("rsvd1")
    3000                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   59

    3001                      .dwattr $C$DW$182, DW_AT_bit_offset(0x08)
    3002                      .dwattr $C$DW$182, DW_AT_bit_size(0x02)
    3003                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3004                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3005              
    3006              $C$DW$183       .dwtag  DW_TAG_member
    3007                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3008                      .dwattr $C$DW$183, DW_AT_name("rsvd2")
    3009                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd2")
    3010                      .dwattr $C$DW$183, DW_AT_bit_offset(0x06)
    3011                      .dwattr $C$DW$183, DW_AT_bit_size(0x02)
    3012                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3013                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3014              
    3015              $C$DW$184       .dwtag  DW_TAG_member
    3016                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    3017                      .dwattr $C$DW$184, DW_AT_name("rsvd3")
    3018                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rsvd3")
    3019                      .dwattr $C$DW$184, DW_AT_bit_offset(0x00)
    3020                      .dwattr $C$DW$184, DW_AT_bit_size(0x06)
    3021                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3022                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3023              
    3024              $C$DW$185       .dwtag  DW_TAG_member
    3025                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    3026                      .dwattr $C$DW$185, DW_AT_name("rsvd4")
    3027                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd4")
    3028                      .dwattr $C$DW$185, DW_AT_bit_offset(0x00)
    3029                      .dwattr $C$DW$185, DW_AT_bit_size(0x10)
    3030                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3031                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3032              
    3033                      .dwendtag $C$DW$T$49
    3034              
    3035              
    3036              $C$DW$T$50      .dwtag  DW_TAG_union_type
    3037                      .dwattr $C$DW$T$50, DW_AT_name("CLKSRCCTL2_REG")
    3038                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x02)
    3039              $C$DW$186       .dwtag  DW_TAG_member
    3040                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$27)
    3041                      .dwattr $C$DW$186, DW_AT_name("all")
    3042                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_all")
    3043                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3044                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3045              
    3046              $C$DW$187       .dwtag  DW_TAG_member
    3047                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$49)
    3048                      .dwattr $C$DW$187, DW_AT_name("bit")
    3049                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_bit")
    3050                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3051                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3052              
    3053                      .dwendtag $C$DW$T$50
    3054              
    3055              
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   60

    3056              $C$DW$T$51      .dwtag  DW_TAG_structure_type
    3057                      .dwattr $C$DW$T$51, DW_AT_name("CLKSRCCTL3_BITS")
    3058                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x02)
    3059              $C$DW$188       .dwtag  DW_TAG_member
    3060                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    3061                      .dwattr $C$DW$188, DW_AT_name("XCLKOUTSEL")
    3062                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_XCLKOUTSEL")
    3063                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0d)
    3064                      .dwattr $C$DW$188, DW_AT_bit_size(0x03)
    3065                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3066                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3067              
    3068              $C$DW$189       .dwtag  DW_TAG_member
    3069                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    3070                      .dwattr $C$DW$189, DW_AT_name("rsvd1")
    3071                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd1")
    3072                      .dwattr $C$DW$189, DW_AT_bit_offset(0x00)
    3073                      .dwattr $C$DW$189, DW_AT_bit_size(0x0d)
    3074                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3075                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3076              
    3077              $C$DW$190       .dwtag  DW_TAG_member
    3078                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    3079                      .dwattr $C$DW$190, DW_AT_name("rsvd2")
    3080                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd2")
    3081                      .dwattr $C$DW$190, DW_AT_bit_offset(0x00)
    3082                      .dwattr $C$DW$190, DW_AT_bit_size(0x10)
    3083                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3084                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3085              
    3086                      .dwendtag $C$DW$T$51
    3087              
    3088              
    3089              $C$DW$T$52      .dwtag  DW_TAG_union_type
    3090                      .dwattr $C$DW$T$52, DW_AT_name("CLKSRCCTL3_REG")
    3091                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x02)
    3092              $C$DW$191       .dwtag  DW_TAG_member
    3093                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$27)
    3094                      .dwattr $C$DW$191, DW_AT_name("all")
    3095                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_all")
    3096                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3097                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3098              
    3099              $C$DW$192       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$51)
    3101                      .dwattr $C$DW$192, DW_AT_name("bit")
    3102                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_bit")
    3103                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3104                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3105              
    3106                      .dwendtag $C$DW$T$52
    3107              
    3108              
    3109              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3110                      .dwattr $C$DW$T$54, DW_AT_name("CLK_CFG_REGS")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   61

    3111                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x32)
    3112              $C$DW$193       .dwtag  DW_TAG_member
    3113                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$46)
    3114                      .dwattr $C$DW$193, DW_AT_name("CLKSEM")
    3115                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_CLKSEM")
    3116                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3117                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3118              
    3119              $C$DW$194       .dwtag  DW_TAG_member
    3120                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$44)
    3121                      .dwattr $C$DW$194, DW_AT_name("CLKCFGLOCK1")
    3122                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_CLKCFGLOCK1")
    3123                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3124                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3125              
    3126              $C$DW$195       .dwtag  DW_TAG_member
    3127                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$53)
    3128                      .dwattr $C$DW$195, DW_AT_name("rsvd1")
    3129                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd1")
    3130                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3131                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3132              
    3133              $C$DW$196       .dwtag  DW_TAG_member
    3134                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$48)
    3135                      .dwattr $C$DW$196, DW_AT_name("CLKSRCCTL1")
    3136                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_CLKSRCCTL1")
    3137                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3138                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3139              
    3140              $C$DW$197       .dwtag  DW_TAG_member
    3141                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$50)
    3142                      .dwattr $C$DW$197, DW_AT_name("CLKSRCCTL2")
    3143                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_CLKSRCCTL2")
    3144                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3145                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3146              
    3147              $C$DW$198       .dwtag  DW_TAG_member
    3148                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$52)
    3149                      .dwattr $C$DW$198, DW_AT_name("CLKSRCCTL3")
    3150                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_CLKSRCCTL3")
    3151                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3152                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3153              
    3154              $C$DW$199       .dwtag  DW_TAG_member
    3155                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$288)
    3156                      .dwattr $C$DW$199, DW_AT_name("SYSPLLCTL1")
    3157                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_SYSPLLCTL1")
    3158                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3159                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3160              
    3161              $C$DW$200       .dwtag  DW_TAG_member
    3162                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$53)
    3163                      .dwattr $C$DW$200, DW_AT_name("rsvd2")
    3164                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rsvd2")
    3165                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   62

    3166                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3167              
    3168              $C$DW$201       .dwtag  DW_TAG_member
    3169                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$290)
    3170                      .dwattr $C$DW$201, DW_AT_name("SYSPLLMULT")
    3171                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_SYSPLLMULT")
    3172                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3173                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3174              
    3175              $C$DW$202       .dwtag  DW_TAG_member
    3176                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$292)
    3177                      .dwattr $C$DW$202, DW_AT_name("SYSPLLSTS")
    3178                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_SYSPLLSTS")
    3179                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3180                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3181              
    3182              $C$DW$203       .dwtag  DW_TAG_member
    3183                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$38)
    3184                      .dwattr $C$DW$203, DW_AT_name("AUXPLLCTL1")
    3185                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_AUXPLLCTL1")
    3186                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3187                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3188              
    3189              $C$DW$204       .dwtag  DW_TAG_member
    3190                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$53)
    3191                      .dwattr $C$DW$204, DW_AT_name("rsvd3")
    3192                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd3")
    3193                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3194                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3195              
    3196              $C$DW$205       .dwtag  DW_TAG_member
    3197                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$40)
    3198                      .dwattr $C$DW$205, DW_AT_name("AUXPLLMULT")
    3199                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_AUXPLLMULT")
    3200                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3201                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3202              
    3203              $C$DW$206       .dwtag  DW_TAG_member
    3204                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$42)
    3205                      .dwattr $C$DW$206, DW_AT_name("AUXPLLSTS")
    3206                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_AUXPLLSTS")
    3207                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3208                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3209              
    3210              $C$DW$207       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$286)
    3212                      .dwattr $C$DW$207, DW_AT_name("SYSCLKDIVSEL")
    3213                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_SYSCLKDIVSEL")
    3214                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3215                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3216              
    3217              $C$DW$208       .dwtag  DW_TAG_member
    3218                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$36)
    3219                      .dwattr $C$DW$208, DW_AT_name("AUXCLKDIVSEL")
    3220                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_AUXCLKDIVSEL")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   63

    3221                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3222                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3223              
    3224              $C$DW$209       .dwtag  DW_TAG_member
    3225                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$244)
    3226                      .dwattr $C$DW$209, DW_AT_name("PERCLKDIVSEL")
    3227                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_PERCLKDIVSEL")
    3228                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3229                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3230              
    3231              $C$DW$210       .dwtag  DW_TAG_member
    3232                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$311)
    3233                      .dwattr $C$DW$210, DW_AT_name("XCLKOUTDIVSEL")
    3234                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_XCLKOUTDIVSEL")
    3235                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3236                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3237              
    3238              $C$DW$211       .dwtag  DW_TAG_member
    3239                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$21)
    3240                      .dwattr $C$DW$211, DW_AT_name("rsvd4")
    3241                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_rsvd4")
    3242                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3243                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3244              
    3245              $C$DW$212       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$202)
    3247                      .dwattr $C$DW$212, DW_AT_name("LOSPCP")
    3248                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_LOSPCP")
    3249                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3250                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3251              
    3252              $C$DW$213       .dwtag  DW_TAG_member
    3253                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$208)
    3254                      .dwattr $C$DW$213, DW_AT_name("MCDCR")
    3255                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_MCDCR")
    3256                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3257                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3258              
    3259              $C$DW$214       .dwtag  DW_TAG_member
    3260                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$309)
    3261                      .dwattr $C$DW$214, DW_AT_name("X1CNT")
    3262                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_X1CNT")
    3263                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3264                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3265              
    3266                      .dwendtag $C$DW$T$54
    3267              
    3268              $C$DW$215       .dwtag  DW_TAG_TI_far_type
    3269                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$54)
    3270              
    3271              $C$DW$T$349     .dwtag  DW_TAG_volatile_type
    3272                      .dwattr $C$DW$T$349, DW_AT_type(*$C$DW$215)
    3273              
    3274              
    3275              $C$DW$T$55      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:12 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_SysCtrl.asm                                                  PAGE   64

    3276                      .dwattr $C$DW$T$55, DW_AT_name("CPU2RESCTL_BITS")
    3277                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x02)
    3278              $C$DW$216       .dwtag  DW_TAG_member
    3279                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3280                      .dwattr $C$DW$216, DW_AT_name("RESET")
    3281                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_RESET")
    3282                      .dwattr $C$DW$216, DW_AT_bit_offset(0x0f)
    3283                      .dwattr $C$DW$216, DW_AT_bit_size(0x01)
    3284                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3285                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3286              
    3287              $C$DW$217       .dwtag  DW_TAG_member
    3288                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    3289                      .dwattr $C$DW$217, DW_AT_name("rsvd1")
    3290                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_rsvd1")
