TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v21.6.0.LTS *
       3              ;* Date/Time created: Thu Jan 20 17:49:12 2022                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/source/F2
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v21.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\controlSUITE\development_kits\TMDSIDDK_v1.0\IDDK_PM_Servo_F28
      13              $C$DW$1 .dwtag  DW_TAG_variable
      14                      .dwattr $C$DW$1, DW_AT_name("SDFM")

TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   41

    1942                      .dwattr $C$DW$78, DW_AT_TI_end_column(0x01)
    1943                      .dwendentry
    1944                      .dwendtag $C$DW$78
    1945              
    1946 00000421               .sect   ".text"
    1947                      .clink
    1948                      .global _SDFM_disableMFE
    1949              
    1950              $C$DW$82        .dwtag  DW_TAG_subprogram
    1951                      .dwattr $C$DW$82, DW_AT_name("SDFM_disableMFE")
    1952                      .dwattr $C$DW$82, DW_AT_low_pc(_SDFM_disableMFE)
    1953                      .dwattr $C$DW$82, DW_AT_high_pc(0x00)
    1954                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_SDFM_disableMFE")
    1955                      .dwattr $C$DW$82, DW_AT_external
    1956                      .dwattr $C$DW$82, DW_AT_TI_begin_file("C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/
    1957                      .dwattr $C$DW$82, DW_AT_TI_begin_line(0x156)
    1958                      .dwattr $C$DW$82, DW_AT_TI_begin_column(0x06)
    1959                      .dwattr $C$DW$82, DW_AT_TI_max_frame_size(-2)
    1960                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/source/F2837xD_sdfm_drive
    1961              
    1962                      .dwfde $C$DW$CIE, _SDFM_disableMFE
    1963              $C$DW$83        .dwtag  DW_TAG_formal_parameter
    1964                      .dwattr $C$DW$83, DW_AT_name("sdfmNumber")
    1965                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_sdfmNumber")
    1966                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1967                      .dwattr $C$DW$83, DW_AT_location[DW_OP_reg0]
    1968              
    1969              
    1970              ;***************************************************************
    1971              ;* FNAME: _SDFM_disableMFE              FR SIZE:   0           *
    1972              ;*                                                             *
    1973              ;* FUNCTION ENVIRONMENT                                        *
    1974              ;*                                                             *
    1975              ;* FUNCTION PROPERTIES                                         *
    1976              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1977              ;***************************************************************
    1978              
    1979 00000421       _SDFM_disableMFE:
    1980                      .dwcfi  cfa_offset, -2
    1981                      .dwcfi  save_reg_to_mem, 26, 0
    1982 00000421 7622   EALLOW
    1983 00000422 2901          CLRC      SXM                   ; [CPU_ALU] 
    1984                      .dwpsn  file "C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/source/F2837xD_sdfm_drive
    1985 00000423 8F00!         MOVL      XAR4,#_SDFM           ; [CPU_ARAU] |346| 
         00000424 0000 
    1986 00000425 5603          MOV       ACC,AL << 1           ; [CPU_ALU] |346| 
         00000426 01A9 
    1987 00000427 5601          ADDL      XAR4,ACC              ; [CPU_ALU] |346| 
         00000428 00A4 
    1988 00000429 8AC4          MOVL      XAR4,*+XAR4[0]        ; [CPU_ALU] |346| 
    1989 0000042a 18F4          AND       *+XAR4[6],#0xf7ff     ; [CPU_ALU] |346| 
         0000042b F7FF 
    1990 0000042c 761A   EDIS
    1991 0000042d FF69          SPM       #0                    ; [CPU_ALU] 
    1992              $C$DW$84        .dwtag  DW_TAG_TI_branch
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   42

    1993                      .dwattr $C$DW$84, DW_AT_low_pc(0x00)
    1994                      .dwattr $C$DW$84, DW_AT_TI_return
    1995              
    1996 0000042e 0006          LRETR     ; [CPU_ALU] 
    1997                      ; return occurs ; [] 
    1998                      .dwattr $C$DW$82, DW_AT_TI_end_file("C:/ti/controlSUITE/device_support/F2837xD/v150/F2837xD_common/so
    1999                      .dwattr $C$DW$82, DW_AT_TI_end_line(0x15d)
    2000                      .dwattr $C$DW$82, DW_AT_TI_end_column(0x01)
    2001                      .dwendentry
    2002                      .dwendtag $C$DW$82
    2003              
    2004              ;**************************************************************
    2005              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2006              ;**************************************************************
    2007                      .global _SDFM
    2008              
    2009              ;***************************************************************
    2010              ;* TYPE INFORMATION                                            *
    2011              ;***************************************************************
    2012              
    2013              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2014                      .dwattr $C$DW$T$20, DW_AT_name("SDCMPH1_BITS")
    2015                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    2016              $C$DW$85        .dwtag  DW_TAG_member
    2017                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    2018                      .dwattr $C$DW$85, DW_AT_name("HLT")
    2019                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_HLT")
    2020                      .dwattr $C$DW$85, DW_AT_bit_offset(0x01)
    2021                      .dwattr $C$DW$85, DW_AT_bit_size(0x0f)
    2022                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2023                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    2024              
    2025              $C$DW$86        .dwtag  DW_TAG_member
    2026                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    2027                      .dwattr $C$DW$86, DW_AT_name("rsvd1")
    2028                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_rsvd1")
    2029                      .dwattr $C$DW$86, DW_AT_bit_offset(0x00)
    2030                      .dwattr $C$DW$86, DW_AT_bit_size(0x01)
    2031                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2032                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    2033              
    2034                      .dwendtag $C$DW$T$20
    2035              
    2036              
    2037              $C$DW$T$21      .dwtag  DW_TAG_union_type
    2038                      .dwattr $C$DW$T$21, DW_AT_name("SDCMPH1_REG")
    2039                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    2040              $C$DW$87        .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    2042                      .dwattr $C$DW$87, DW_AT_name("all")
    2043                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_all")
    2044                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2045                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    2046              
    2047              $C$DW$88        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   43

    2048                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
    2049                      .dwattr $C$DW$88, DW_AT_name("bit")
    2050                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_bit")
    2051                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2052                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2053              
    2054                      .dwendtag $C$DW$T$21
    2055              
    2056              
    2057              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2058                      .dwattr $C$DW$T$22, DW_AT_name("SDCMPH2_BITS")
    2059                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    2060              $C$DW$89        .dwtag  DW_TAG_member
    2061                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    2062                      .dwattr $C$DW$89, DW_AT_name("HLT")
    2063                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_HLT")
    2064                      .dwattr $C$DW$89, DW_AT_bit_offset(0x01)
    2065                      .dwattr $C$DW$89, DW_AT_bit_size(0x0f)
    2066                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2067                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2068              
    2069              $C$DW$90        .dwtag  DW_TAG_member
    2070                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    2071                      .dwattr $C$DW$90, DW_AT_name("rsvd1")
    2072                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd1")
    2073                      .dwattr $C$DW$90, DW_AT_bit_offset(0x00)
    2074                      .dwattr $C$DW$90, DW_AT_bit_size(0x01)
    2075                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2076                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2077              
    2078                      .dwendtag $C$DW$T$22
    2079              
    2080              
    2081              $C$DW$T$23      .dwtag  DW_TAG_union_type
    2082                      .dwattr $C$DW$T$23, DW_AT_name("SDCMPH2_REG")
    2083                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    2084              $C$DW$91        .dwtag  DW_TAG_member
    2085                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    2086                      .dwattr $C$DW$91, DW_AT_name("all")
    2087                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_all")
    2088                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2089                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2090              
    2091              $C$DW$92        .dwtag  DW_TAG_member
    2092                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$22)
    2093                      .dwattr $C$DW$92, DW_AT_name("bit")
    2094                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_bit")
    2095                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2096                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2097              
    2098                      .dwendtag $C$DW$T$23
    2099              
    2100              
    2101              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2102                      .dwattr $C$DW$T$24, DW_AT_name("SDCMPH3_BITS")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   44

    2103                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    2104              $C$DW$93        .dwtag  DW_TAG_member
    2105                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    2106                      .dwattr $C$DW$93, DW_AT_name("HLT")
    2107                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_HLT")
    2108                      .dwattr $C$DW$93, DW_AT_bit_offset(0x01)
    2109                      .dwattr $C$DW$93, DW_AT_bit_size(0x0f)
    2110                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2111                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2112              
    2113              $C$DW$94        .dwtag  DW_TAG_member
    2114                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    2115                      .dwattr $C$DW$94, DW_AT_name("rsvd1")
    2116                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd1")
    2117                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00)
    2118                      .dwattr $C$DW$94, DW_AT_bit_size(0x01)
    2119                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2120                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2121              
    2122                      .dwendtag $C$DW$T$24
    2123              
    2124              
    2125              $C$DW$T$25      .dwtag  DW_TAG_union_type
    2126                      .dwattr $C$DW$T$25, DW_AT_name("SDCMPH3_REG")
    2127                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    2128              $C$DW$95        .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    2130                      .dwattr $C$DW$95, DW_AT_name("all")
    2131                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
    2132                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2133                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2134              
    2135              $C$DW$96        .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$24)
    2137                      .dwattr $C$DW$96, DW_AT_name("bit")
    2138                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
    2139                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2140                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2141              
    2142                      .dwendtag $C$DW$T$25
    2143              
    2144              
    2145              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2146                      .dwattr $C$DW$T$26, DW_AT_name("SDCMPH4_BITS")
    2147                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    2148              $C$DW$97        .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    2150                      .dwattr $C$DW$97, DW_AT_name("HLT")
    2151                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_HLT")
    2152                      .dwattr $C$DW$97, DW_AT_bit_offset(0x01)
    2153                      .dwattr $C$DW$97, DW_AT_bit_size(0x0f)
    2154                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2155                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2156              
    2157              $C$DW$98        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   45

    2158                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    2159                      .dwattr $C$DW$98, DW_AT_name("rsvd1")
    2160                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd1")
    2161                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00)
    2162                      .dwattr $C$DW$98, DW_AT_bit_size(0x01)
    2163                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2164                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2165              
    2166                      .dwendtag $C$DW$T$26
    2167              
    2168              
    2169              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2170                      .dwattr $C$DW$T$27, DW_AT_name("SDCMPH4_REG")
    2171                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    2172              $C$DW$99        .dwtag  DW_TAG_member
    2173                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    2174                      .dwattr $C$DW$99, DW_AT_name("all")
    2175                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_all")
    2176                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2177                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2178              
    2179              $C$DW$100       .dwtag  DW_TAG_member
    2180                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$26)
    2181                      .dwattr $C$DW$100, DW_AT_name("bit")
    2182                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_bit")
    2183                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2184                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2185              
    2186                      .dwendtag $C$DW$T$27
    2187              
    2188              
    2189              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2190                      .dwattr $C$DW$T$28, DW_AT_name("SDCMPL1_BITS")
    2191                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    2192              $C$DW$101       .dwtag  DW_TAG_member
    2193                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2194                      .dwattr $C$DW$101, DW_AT_name("LLT")
    2195                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_LLT")
    2196                      .dwattr $C$DW$101, DW_AT_bit_offset(0x01)
    2197                      .dwattr $C$DW$101, DW_AT_bit_size(0x0f)
    2198                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2199                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2200              
    2201              $C$DW$102       .dwtag  DW_TAG_member
    2202                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    2203                      .dwattr $C$DW$102, DW_AT_name("rsvd1")
    2204                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd1")
    2205                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00)
    2206                      .dwattr $C$DW$102, DW_AT_bit_size(0x01)
    2207                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2208                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2209              
    2210                      .dwendtag $C$DW$T$28
    2211              
    2212              
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   46

    2213              $C$DW$T$29      .dwtag  DW_TAG_union_type
    2214                      .dwattr $C$DW$T$29, DW_AT_name("SDCMPL1_REG")
    2215                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2216              $C$DW$103       .dwtag  DW_TAG_member
    2217                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    2218                      .dwattr $C$DW$103, DW_AT_name("all")
    2219                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_all")
    2220                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2221                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2222              
    2223              $C$DW$104       .dwtag  DW_TAG_member
    2224                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$28)
    2225                      .dwattr $C$DW$104, DW_AT_name("bit")
    2226                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_bit")
    2227                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2228                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2229              
    2230                      .dwendtag $C$DW$T$29
    2231              
    2232              
    2233              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2234                      .dwattr $C$DW$T$30, DW_AT_name("SDCMPL2_BITS")
    2235                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2236              $C$DW$105       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$105, DW_AT_name("LLT")
    2239                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_LLT")
    2240                      .dwattr $C$DW$105, DW_AT_bit_offset(0x01)
    2241                      .dwattr $C$DW$105, DW_AT_bit_size(0x0f)
    2242                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2243                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2244              
    2245              $C$DW$106       .dwtag  DW_TAG_member
    2246                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    2247                      .dwattr $C$DW$106, DW_AT_name("rsvd1")
    2248                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd1")
    2249                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00)
    2250                      .dwattr $C$DW$106, DW_AT_bit_size(0x01)
    2251                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2252                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2253              
    2254                      .dwendtag $C$DW$T$30
    2255              
    2256              
    2257              $C$DW$T$31      .dwtag  DW_TAG_union_type
    2258                      .dwattr $C$DW$T$31, DW_AT_name("SDCMPL2_REG")
    2259                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2260              $C$DW$107       .dwtag  DW_TAG_member
    2261                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    2262                      .dwattr $C$DW$107, DW_AT_name("all")
    2263                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_all")
    2264                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2265                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2266              
    2267              $C$DW$108       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   47

    2268                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$30)
    2269                      .dwattr $C$DW$108, DW_AT_name("bit")
    2270                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_bit")
    2271                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2272                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2273              
    2274                      .dwendtag $C$DW$T$31
    2275              
    2276              
    2277              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2278                      .dwattr $C$DW$T$32, DW_AT_name("SDCMPL3_BITS")
    2279                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2280              $C$DW$109       .dwtag  DW_TAG_member
    2281                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2282                      .dwattr $C$DW$109, DW_AT_name("LLT")
    2283                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_LLT")
    2284                      .dwattr $C$DW$109, DW_AT_bit_offset(0x01)
    2285                      .dwattr $C$DW$109, DW_AT_bit_size(0x0f)
    2286                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2288              
    2289              $C$DW$110       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2291                      .dwattr $C$DW$110, DW_AT_name("rsvd1")
    2292                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd1")
    2293                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00)
    2294                      .dwattr $C$DW$110, DW_AT_bit_size(0x01)
    2295                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2296                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2297              
    2298                      .dwendtag $C$DW$T$32
    2299              
    2300              
    2301              $C$DW$T$33      .dwtag  DW_TAG_union_type
    2302                      .dwattr $C$DW$T$33, DW_AT_name("SDCMPL3_REG")
    2303                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    2304              $C$DW$111       .dwtag  DW_TAG_member
    2305                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2306                      .dwattr $C$DW$111, DW_AT_name("all")
    2307                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    2308                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2309                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2310              
    2311              $C$DW$112       .dwtag  DW_TAG_member
    2312                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$32)
    2313                      .dwattr $C$DW$112, DW_AT_name("bit")
    2314                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    2315                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2316                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2317              
    2318                      .dwendtag $C$DW$T$33
    2319              
    2320              
    2321              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2322                      .dwattr $C$DW$T$34, DW_AT_name("SDCMPL4_BITS")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   48

    2323                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2324              $C$DW$113       .dwtag  DW_TAG_member
    2325                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2326                      .dwattr $C$DW$113, DW_AT_name("LLT")
    2327                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_LLT")
    2328                      .dwattr $C$DW$113, DW_AT_bit_offset(0x01)
    2329                      .dwattr $C$DW$113, DW_AT_bit_size(0x0f)
    2330                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2331                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2332              
    2333              $C$DW$114       .dwtag  DW_TAG_member
    2334                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2335                      .dwattr $C$DW$114, DW_AT_name("rsvd1")
    2336                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd1")
    2337                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00)
    2338                      .dwattr $C$DW$114, DW_AT_bit_size(0x01)
    2339                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2340                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2341              
    2342                      .dwendtag $C$DW$T$34
    2343              
    2344              
    2345              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2346                      .dwattr $C$DW$T$35, DW_AT_name("SDCMPL4_REG")
    2347                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2348              $C$DW$115       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2350                      .dwattr $C$DW$115, DW_AT_name("all")
    2351                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_all")
    2352                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2353                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2354              
    2355              $C$DW$116       .dwtag  DW_TAG_member
    2356                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$34)
    2357                      .dwattr $C$DW$116, DW_AT_name("bit")
    2358                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_bit")
    2359                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2360                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2361              
    2362                      .dwendtag $C$DW$T$35
    2363              
    2364              
    2365              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2366                      .dwattr $C$DW$T$36, DW_AT_name("SDCPARM1_BITS")
    2367                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2368              $C$DW$117       .dwtag  DW_TAG_member
    2369                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2370                      .dwattr $C$DW$117, DW_AT_name("COSR")
    2371                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_COSR")
    2372                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0b)
    2373                      .dwattr $C$DW$117, DW_AT_bit_size(0x05)
    2374                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2375                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2376              
    2377              $C$DW$118       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   49

    2378                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2379                      .dwattr $C$DW$118, DW_AT_name("IEH")
    2380                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_IEH")
    2381                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0a)
    2382                      .dwattr $C$DW$118, DW_AT_bit_size(0x01)
    2383                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2384                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2385              
    2386              $C$DW$119       .dwtag  DW_TAG_member
    2387                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2388                      .dwattr $C$DW$119, DW_AT_name("IEL")
    2389                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_IEL")
    2390                      .dwattr $C$DW$119, DW_AT_bit_offset(0x09)
    2391                      .dwattr $C$DW$119, DW_AT_bit_size(0x01)
    2392                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2393                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2394              
    2395              $C$DW$120       .dwtag  DW_TAG_member
    2396                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2397                      .dwattr $C$DW$120, DW_AT_name("CS1_CS0")
    2398                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_CS1_CS0")
    2399                      .dwattr $C$DW$120, DW_AT_bit_offset(0x07)
    2400                      .dwattr $C$DW$120, DW_AT_bit_size(0x02)
    2401                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2402                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2403              
    2404              $C$DW$121       .dwtag  DW_TAG_member
    2405                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    2406                      .dwattr $C$DW$121, DW_AT_name("MFIE")
    2407                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_MFIE")
    2408                      .dwattr $C$DW$121, DW_AT_bit_offset(0x06)
    2409                      .dwattr $C$DW$121, DW_AT_bit_size(0x01)
    2410                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2411                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2412              
    2413              $C$DW$122       .dwtag  DW_TAG_member
    2414                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2415                      .dwattr $C$DW$122, DW_AT_name("rsvd1")
    2416                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_rsvd1")
    2417                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00)
    2418                      .dwattr $C$DW$122, DW_AT_bit_size(0x06)
    2419                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2420                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2421              
    2422                      .dwendtag $C$DW$T$36
    2423              
    2424              
    2425              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2426                      .dwattr $C$DW$T$37, DW_AT_name("SDCPARM1_REG")
    2427                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2428              $C$DW$123       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2430                      .dwattr $C$DW$123, DW_AT_name("all")
    2431                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_all")
    2432                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   50

    2433                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2434              
    2435              $C$DW$124       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$36)
    2437                      .dwattr $C$DW$124, DW_AT_name("bit")
    2438                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_bit")
    2439                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2440                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2441              
    2442                      .dwendtag $C$DW$T$37
    2443              
    2444              
    2445              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2446                      .dwattr $C$DW$T$38, DW_AT_name("SDCPARM2_BITS")
    2447                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2448              $C$DW$125       .dwtag  DW_TAG_member
    2449                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2450                      .dwattr $C$DW$125, DW_AT_name("COSR")
    2451                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_COSR")
    2452                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0b)
    2453                      .dwattr $C$DW$125, DW_AT_bit_size(0x05)
    2454                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2455                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2456              
    2457              $C$DW$126       .dwtag  DW_TAG_member
    2458                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2459                      .dwattr $C$DW$126, DW_AT_name("IEH")
    2460                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_IEH")
    2461                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0a)
    2462                      .dwattr $C$DW$126, DW_AT_bit_size(0x01)
    2463                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2464                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2465              
    2466              $C$DW$127       .dwtag  DW_TAG_member
    2467                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    2468                      .dwattr $C$DW$127, DW_AT_name("IEL")
    2469                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_IEL")
    2470                      .dwattr $C$DW$127, DW_AT_bit_offset(0x09)
    2471                      .dwattr $C$DW$127, DW_AT_bit_size(0x01)
    2472                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2473                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2474              
    2475              $C$DW$128       .dwtag  DW_TAG_member
    2476                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    2477                      .dwattr $C$DW$128, DW_AT_name("CS1_CS0")
    2478                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_CS1_CS0")
    2479                      .dwattr $C$DW$128, DW_AT_bit_offset(0x07)
    2480                      .dwattr $C$DW$128, DW_AT_bit_size(0x02)
    2481                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2482                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2483              
    2484              $C$DW$129       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    2486                      .dwattr $C$DW$129, DW_AT_name("MFIE")
    2487                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_MFIE")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   51

    2488                      .dwattr $C$DW$129, DW_AT_bit_offset(0x06)
    2489                      .dwattr $C$DW$129, DW_AT_bit_size(0x01)
    2490                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2491                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2492              
    2493              $C$DW$130       .dwtag  DW_TAG_member
    2494                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    2495                      .dwattr $C$DW$130, DW_AT_name("rsvd1")
    2496                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd1")
    2497                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00)
    2498                      .dwattr $C$DW$130, DW_AT_bit_size(0x06)
    2499                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2500                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2501              
    2502                      .dwendtag $C$DW$T$38
    2503              
    2504              
    2505              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2506                      .dwattr $C$DW$T$39, DW_AT_name("SDCPARM2_REG")
    2507                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2508              $C$DW$131       .dwtag  DW_TAG_member
    2509                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2510                      .dwattr $C$DW$131, DW_AT_name("all")
    2511                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    2512                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2513                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2514              
    2515              $C$DW$132       .dwtag  DW_TAG_member
    2516                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$38)
    2517                      .dwattr $C$DW$132, DW_AT_name("bit")
    2518                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    2519                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2520                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2521              
    2522                      .dwendtag $C$DW$T$39
    2523              
    2524              
    2525              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2526                      .dwattr $C$DW$T$40, DW_AT_name("SDCPARM3_BITS")
    2527                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2528              $C$DW$133       .dwtag  DW_TAG_member
    2529                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2530                      .dwattr $C$DW$133, DW_AT_name("COSR")
    2531                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_COSR")
    2532                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0b)
    2533                      .dwattr $C$DW$133, DW_AT_bit_size(0x05)
    2534                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2535                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2536              
    2537              $C$DW$134       .dwtag  DW_TAG_member
    2538                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    2539                      .dwattr $C$DW$134, DW_AT_name("IEH")
    2540                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_IEH")
    2541                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0a)
    2542                      .dwattr $C$DW$134, DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   52

    2543                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2544                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2545              
    2546              $C$DW$135       .dwtag  DW_TAG_member
    2547                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    2548                      .dwattr $C$DW$135, DW_AT_name("IEL")
    2549                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_IEL")
    2550                      .dwattr $C$DW$135, DW_AT_bit_offset(0x09)
    2551                      .dwattr $C$DW$135, DW_AT_bit_size(0x01)
    2552                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2553                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2554              
    2555              $C$DW$136       .dwtag  DW_TAG_member
    2556                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2557                      .dwattr $C$DW$136, DW_AT_name("CS1_CS0")
    2558                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_CS1_CS0")
    2559                      .dwattr $C$DW$136, DW_AT_bit_offset(0x07)
    2560                      .dwattr $C$DW$136, DW_AT_bit_size(0x02)
    2561                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2562                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2563              
    2564              $C$DW$137       .dwtag  DW_TAG_member
    2565                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    2566                      .dwattr $C$DW$137, DW_AT_name("MFIE")
    2567                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_MFIE")
    2568                      .dwattr $C$DW$137, DW_AT_bit_offset(0x06)
    2569                      .dwattr $C$DW$137, DW_AT_bit_size(0x01)
    2570                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2571                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2572              
    2573              $C$DW$138       .dwtag  DW_TAG_member
    2574                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    2575                      .dwattr $C$DW$138, DW_AT_name("rsvd1")
    2576                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_rsvd1")
    2577                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00)
    2578                      .dwattr $C$DW$138, DW_AT_bit_size(0x06)
    2579                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2580                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2581              
    2582                      .dwendtag $C$DW$T$40
    2583              
    2584              
    2585              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2586                      .dwattr $C$DW$T$41, DW_AT_name("SDCPARM3_REG")
    2587                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2588              $C$DW$139       .dwtag  DW_TAG_member
    2589                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    2590                      .dwattr $C$DW$139, DW_AT_name("all")
    2591                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_all")
    2592                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2593                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2594              
    2595              $C$DW$140       .dwtag  DW_TAG_member
    2596                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$40)
    2597                      .dwattr $C$DW$140, DW_AT_name("bit")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   53

    2598                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_bit")
    2599                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2600                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2601              
    2602                      .dwendtag $C$DW$T$41
    2603              
    2604              
    2605              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2606                      .dwattr $C$DW$T$42, DW_AT_name("SDCPARM4_BITS")
    2607                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2608              $C$DW$141       .dwtag  DW_TAG_member
    2609                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    2610                      .dwattr $C$DW$141, DW_AT_name("COSR")
    2611                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_COSR")
    2612                      .dwattr $C$DW$141, DW_AT_bit_offset(0x0b)
    2613                      .dwattr $C$DW$141, DW_AT_bit_size(0x05)
    2614                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2615                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2616              
    2617              $C$DW$142       .dwtag  DW_TAG_member
    2618                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2619                      .dwattr $C$DW$142, DW_AT_name("IEH")
    2620                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_IEH")
    2621                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0a)
    2622                      .dwattr $C$DW$142, DW_AT_bit_size(0x01)
    2623                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2624                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2625              
    2626              $C$DW$143       .dwtag  DW_TAG_member
    2627                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2628                      .dwattr $C$DW$143, DW_AT_name("IEL")
    2629                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_IEL")
    2630                      .dwattr $C$DW$143, DW_AT_bit_offset(0x09)
    2631                      .dwattr $C$DW$143, DW_AT_bit_size(0x01)
    2632                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2633                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2634              
    2635              $C$DW$144       .dwtag  DW_TAG_member
    2636                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2637                      .dwattr $C$DW$144, DW_AT_name("CS1_CS0")
    2638                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_CS1_CS0")
    2639                      .dwattr $C$DW$144, DW_AT_bit_offset(0x07)
    2640                      .dwattr $C$DW$144, DW_AT_bit_size(0x02)
    2641                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2642                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2643              
    2644              $C$DW$145       .dwtag  DW_TAG_member
    2645                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2646                      .dwattr $C$DW$145, DW_AT_name("MFIE")
    2647                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_MFIE")
    2648                      .dwattr $C$DW$145, DW_AT_bit_offset(0x06)
    2649                      .dwattr $C$DW$145, DW_AT_bit_size(0x01)
    2650                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2651                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2652              
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   54

    2653              $C$DW$146       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    2655                      .dwattr $C$DW$146, DW_AT_name("rsvd1")
    2656                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd1")
    2657                      .dwattr $C$DW$146, DW_AT_bit_offset(0x00)
    2658                      .dwattr $C$DW$146, DW_AT_bit_size(0x06)
    2659                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2660                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2661              
    2662                      .dwendtag $C$DW$T$42
    2663              
    2664              
    2665              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2666                      .dwattr $C$DW$T$43, DW_AT_name("SDCPARM4_REG")
    2667                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2668              $C$DW$147       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    2670                      .dwattr $C$DW$147, DW_AT_name("all")
    2671                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_all")
    2672                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2673                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2674              
    2675              $C$DW$148       .dwtag  DW_TAG_member
    2676                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$42)
    2677                      .dwattr $C$DW$148, DW_AT_name("bit")
    2678                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_bit")
    2679                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2680                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2681              
    2682                      .dwendtag $C$DW$T$43
    2683              
    2684              
    2685              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2686                      .dwattr $C$DW$T$44, DW_AT_name("SDCTLPARM1_BITS")
    2687                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    2688              $C$DW$149       .dwtag  DW_TAG_member
    2689                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2690                      .dwattr $C$DW$149, DW_AT_name("MOD")
    2691                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_MOD")
    2692                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0e)
    2693                      .dwattr $C$DW$149, DW_AT_bit_size(0x02)
    2694                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2696              
    2697              $C$DW$150       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2699                      .dwattr $C$DW$150, DW_AT_name("rsvd1")
    2700                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd1")
    2701                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0d)
    2702                      .dwattr $C$DW$150, DW_AT_bit_size(0x01)
    2703                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2704                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2705              
    2706              $C$DW$151       .dwtag  DW_TAG_member
    2707                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   55

    2708                      .dwattr $C$DW$151, DW_AT_name("rsvd2")
    2709                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd2")
    2710                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0c)
    2711                      .dwattr $C$DW$151, DW_AT_bit_size(0x01)
    2712                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2713                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2714              
    2715              $C$DW$152       .dwtag  DW_TAG_member
    2716                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2717                      .dwattr $C$DW$152, DW_AT_name("rsvd3")
    2718                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd3")
    2719                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0b)
    2720                      .dwattr $C$DW$152, DW_AT_bit_size(0x01)
    2721                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2722                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2723              
    2724              $C$DW$153       .dwtag  DW_TAG_member
    2725                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2726                      .dwattr $C$DW$153, DW_AT_name("MS")
    2727                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_MS")
    2728                      .dwattr $C$DW$153, DW_AT_bit_offset(0x00)
    2729                      .dwattr $C$DW$153, DW_AT_bit_size(0x0b)
    2730                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2731                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2732              
    2733                      .dwendtag $C$DW$T$44
    2734              
    2735              
    2736              $C$DW$T$45      .dwtag  DW_TAG_union_type
    2737                      .dwattr $C$DW$T$45, DW_AT_name("SDCTLPARM1_REG")
    2738                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    2739              $C$DW$154       .dwtag  DW_TAG_member
    2740                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2741                      .dwattr $C$DW$154, DW_AT_name("all")
    2742                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_all")
    2743                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2744                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2745              
    2746              $C$DW$155       .dwtag  DW_TAG_member
    2747                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$44)
    2748                      .dwattr $C$DW$155, DW_AT_name("bit")
    2749                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_bit")
    2750                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2751                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2752              
    2753                      .dwendtag $C$DW$T$45
    2754              
    2755              
    2756              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2757                      .dwattr $C$DW$T$46, DW_AT_name("SDCTLPARM2_BITS")
    2758                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    2759              $C$DW$156       .dwtag  DW_TAG_member
    2760                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2761                      .dwattr $C$DW$156, DW_AT_name("MOD")
    2762                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_MOD")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   56

    2763                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0e)
    2764                      .dwattr $C$DW$156, DW_AT_bit_size(0x02)
    2765                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2766                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2767              
    2768              $C$DW$157       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2770                      .dwattr $C$DW$157, DW_AT_name("rsvd1")
    2771                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd1")
    2772                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0d)
    2773                      .dwattr $C$DW$157, DW_AT_bit_size(0x01)
    2774                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2775                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2776              
    2777              $C$DW$158       .dwtag  DW_TAG_member
    2778                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2779                      .dwattr $C$DW$158, DW_AT_name("rsvd2")
    2780                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd2")
    2781                      .dwattr $C$DW$158, DW_AT_bit_offset(0x0c)
    2782                      .dwattr $C$DW$158, DW_AT_bit_size(0x01)
    2783                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2784                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2785              
    2786              $C$DW$159       .dwtag  DW_TAG_member
    2787                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    2788                      .dwattr $C$DW$159, DW_AT_name("rsvd3")
    2789                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd3")
    2790                      .dwattr $C$DW$159, DW_AT_bit_offset(0x0b)
    2791                      .dwattr $C$DW$159, DW_AT_bit_size(0x01)
    2792                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2793                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2794              
    2795              $C$DW$160       .dwtag  DW_TAG_member
    2796                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2797                      .dwattr $C$DW$160, DW_AT_name("MS")
    2798                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_MS")
    2799                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00)
    2800                      .dwattr $C$DW$160, DW_AT_bit_size(0x0b)
    2801                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2802                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2803              
    2804                      .dwendtag $C$DW$T$46
    2805              
    2806              
    2807              $C$DW$T$47      .dwtag  DW_TAG_union_type
    2808                      .dwattr $C$DW$T$47, DW_AT_name("SDCTLPARM2_REG")
    2809                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    2810              $C$DW$161       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2812                      .dwattr $C$DW$161, DW_AT_name("all")
    2813                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_all")
    2814                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2815                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2816              
    2817              $C$DW$162       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   57

    2818                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$46)
    2819                      .dwattr $C$DW$162, DW_AT_name("bit")
    2820                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_bit")
    2821                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2822                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2823              
    2824                      .dwendtag $C$DW$T$47
    2825              
    2826              
    2827              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2828                      .dwattr $C$DW$T$48, DW_AT_name("SDCTLPARM3_BITS")
    2829                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    2830              $C$DW$163       .dwtag  DW_TAG_member
    2831                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2832                      .dwattr $C$DW$163, DW_AT_name("MOD")
    2833                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_MOD")
    2834                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0e)
    2835                      .dwattr $C$DW$163, DW_AT_bit_size(0x02)
    2836                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2837                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2838              
    2839              $C$DW$164       .dwtag  DW_TAG_member
    2840                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2841                      .dwattr $C$DW$164, DW_AT_name("rsvd1")
    2842                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd1")
    2843                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0d)
    2844                      .dwattr $C$DW$164, DW_AT_bit_size(0x01)
    2845                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2846                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2847              
    2848              $C$DW$165       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2850                      .dwattr $C$DW$165, DW_AT_name("rsvd2")
    2851                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd2")
    2852                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0c)
    2853                      .dwattr $C$DW$165, DW_AT_bit_size(0x01)
    2854                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2855                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2856              
    2857              $C$DW$166       .dwtag  DW_TAG_member
    2858                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2859                      .dwattr $C$DW$166, DW_AT_name("rsvd3")
    2860                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd3")
    2861                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0b)
    2862                      .dwattr $C$DW$166, DW_AT_bit_size(0x01)
    2863                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2864                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2865              
    2866              $C$DW$167       .dwtag  DW_TAG_member
    2867                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2868                      .dwattr $C$DW$167, DW_AT_name("MS")
    2869                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_MS")
    2870                      .dwattr $C$DW$167, DW_AT_bit_offset(0x00)
    2871                      .dwattr $C$DW$167, DW_AT_bit_size(0x0b)
    2872                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   58

    2873                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2874              
    2875                      .dwendtag $C$DW$T$48
    2876              
    2877              
    2878              $C$DW$T$49      .dwtag  DW_TAG_union_type
    2879                      .dwattr $C$DW$T$49, DW_AT_name("SDCTLPARM3_REG")
    2880                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    2881              $C$DW$168       .dwtag  DW_TAG_member
    2882                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2883                      .dwattr $C$DW$168, DW_AT_name("all")
    2884                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_all")
    2885                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2886                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2887              
    2888              $C$DW$169       .dwtag  DW_TAG_member
    2889                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$48)
    2890                      .dwattr $C$DW$169, DW_AT_name("bit")
    2891                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_bit")
    2892                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2893                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2894              
    2895                      .dwendtag $C$DW$T$49
    2896              
    2897              
    2898              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    2899                      .dwattr $C$DW$T$50, DW_AT_name("SDCTLPARM4_BITS")
    2900                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    2901              $C$DW$170       .dwtag  DW_TAG_member
    2902                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2903                      .dwattr $C$DW$170, DW_AT_name("MOD")
    2904                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_MOD")
    2905                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0e)
    2906                      .dwattr $C$DW$170, DW_AT_bit_size(0x02)
    2907                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2908                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2909              
    2910              $C$DW$171       .dwtag  DW_TAG_member
    2911                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2912                      .dwattr $C$DW$171, DW_AT_name("rsvd1")
    2913                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd1")
    2914                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0d)
    2915                      .dwattr $C$DW$171, DW_AT_bit_size(0x01)
    2916                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2917                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2918              
    2919              $C$DW$172       .dwtag  DW_TAG_member
    2920                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2921                      .dwattr $C$DW$172, DW_AT_name("rsvd2")
    2922                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd2")
    2923                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0c)
    2924                      .dwattr $C$DW$172, DW_AT_bit_size(0x01)
    2925                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2926                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2927              
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   59

    2928              $C$DW$173       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2930                      .dwattr $C$DW$173, DW_AT_name("rsvd3")
    2931                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd3")
    2932                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0b)
    2933                      .dwattr $C$DW$173, DW_AT_bit_size(0x01)
    2934                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2935                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2936              
    2937              $C$DW$174       .dwtag  DW_TAG_member
    2938                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2939                      .dwattr $C$DW$174, DW_AT_name("MS")
    2940                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_MS")
    2941                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00)
    2942                      .dwattr $C$DW$174, DW_AT_bit_size(0x0b)
    2943                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2944                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2945              
    2946                      .dwendtag $C$DW$T$50
    2947              
    2948              
    2949              $C$DW$T$51      .dwtag  DW_TAG_union_type
    2950                      .dwattr $C$DW$T$51, DW_AT_name("SDCTLPARM4_REG")
    2951                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    2952              $C$DW$175       .dwtag  DW_TAG_member
    2953                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2954                      .dwattr $C$DW$175, DW_AT_name("all")
    2955                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_all")
    2956                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2957                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2958              
    2959              $C$DW$176       .dwtag  DW_TAG_member
    2960                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$50)
    2961                      .dwattr $C$DW$176, DW_AT_name("bit")
    2962                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_bit")
    2963                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2964                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2965              
    2966                      .dwendtag $C$DW$T$51
    2967              
    2968              
    2969              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2970                      .dwattr $C$DW$T$52, DW_AT_name("SDCTL_BITS")
    2971                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    2972              $C$DW$177       .dwtag  DW_TAG_member
    2973                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2974                      .dwattr $C$DW$177, DW_AT_name("rsvd1")
    2975                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd1")
    2976                      .dwattr $C$DW$177, DW_AT_bit_offset(0x03)
    2977                      .dwattr $C$DW$177, DW_AT_bit_size(0x0d)
    2978                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2979                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2980              
    2981              $C$DW$178       .dwtag  DW_TAG_member
    2982                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   60

    2983                      .dwattr $C$DW$178, DW_AT_name("MIE")
    2984                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_MIE")
    2985                      .dwattr $C$DW$178, DW_AT_bit_offset(0x02)
    2986                      .dwattr $C$DW$178, DW_AT_bit_size(0x01)
    2987                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2988                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2989              
    2990              $C$DW$179       .dwtag  DW_TAG_member
    2991                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2992                      .dwattr $C$DW$179, DW_AT_name("rsvd2")
    2993                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd2")
    2994                      .dwattr $C$DW$179, DW_AT_bit_offset(0x01)
    2995                      .dwattr $C$DW$179, DW_AT_bit_size(0x01)
    2996                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2997                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2998              
    2999              $C$DW$180       .dwtag  DW_TAG_member
    3000                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    3001                      .dwattr $C$DW$180, DW_AT_name("rsvd3")
    3002                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd3")
    3003                      .dwattr $C$DW$180, DW_AT_bit_offset(0x00)
    3004                      .dwattr $C$DW$180, DW_AT_bit_size(0x01)
    3005                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3006                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3007              
    3008                      .dwendtag $C$DW$T$52
    3009              
    3010              
    3011              $C$DW$T$53      .dwtag  DW_TAG_union_type
    3012                      .dwattr $C$DW$T$53, DW_AT_name("SDCTL_REG")
    3013                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    3014              $C$DW$181       .dwtag  DW_TAG_member
    3015                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    3016                      .dwattr $C$DW$181, DW_AT_name("all")
    3017                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_all")
    3018                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3019                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3020              
    3021              $C$DW$182       .dwtag  DW_TAG_member
    3022                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$52)
    3023                      .dwattr $C$DW$182, DW_AT_name("bit")
    3024                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_bit")
    3025                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3026                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3027              
    3028                      .dwendtag $C$DW$T$53
    3029              
    3030              
    3031              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3032                      .dwattr $C$DW$T$54, DW_AT_name("SDDATA1_BITS")
    3033                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x02)
    3034              $C$DW$183       .dwtag  DW_TAG_member
    3035                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    3036                      .dwattr $C$DW$183, DW_AT_name("DATA16")
    3037                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_DATA16")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   61

    3038                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00)
    3039                      .dwattr $C$DW$183, DW_AT_bit_size(0x10)
    3040                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3041                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3042              
    3043              $C$DW$184       .dwtag  DW_TAG_member
    3044                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    3045                      .dwattr $C$DW$184, DW_AT_name("DATA32HI")
    3046                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_DATA32HI")
    3047                      .dwattr $C$DW$184, DW_AT_bit_offset(0x00)
    3048                      .dwattr $C$DW$184, DW_AT_bit_size(0x10)
    3049                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3050                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3051              
    3052                      .dwendtag $C$DW$T$54
    3053              
    3054              
    3055              $C$DW$T$56      .dwtag  DW_TAG_union_type
    3056                      .dwattr $C$DW$T$56, DW_AT_name("SDDATA1_REG")
    3057                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x02)
    3058              $C$DW$185       .dwtag  DW_TAG_member
    3059                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$55)
    3060                      .dwattr $C$DW$185, DW_AT_name("all")
    3061                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_all")
    3062                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3063                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3064              
    3065              $C$DW$186       .dwtag  DW_TAG_member
    3066                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$54)
    3067                      .dwattr $C$DW$186, DW_AT_name("bit")
    3068                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_bit")
    3069                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3070                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3071              
    3072                      .dwendtag $C$DW$T$56
    3073              
    3074              
    3075              $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3076                      .dwattr $C$DW$T$57, DW_AT_name("SDDATA2_BITS")
    3077                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x02)
    3078              $C$DW$187       .dwtag  DW_TAG_member
    3079                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    3080                      .dwattr $C$DW$187, DW_AT_name("DATA16")
    3081                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_DATA16")
    3082                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00)
    3083                      .dwattr $C$DW$187, DW_AT_bit_size(0x10)
    3084                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3085                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3086              
    3087              $C$DW$188       .dwtag  DW_TAG_member
    3088                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    3089                      .dwattr $C$DW$188, DW_AT_name("DATA32HI")
    3090                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_DATA32HI")
    3091                      .dwattr $C$DW$188, DW_AT_bit_offset(0x00)
    3092                      .dwattr $C$DW$188, DW_AT_bit_size(0x10)
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   62

    3093                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3094                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3095              
    3096                      .dwendtag $C$DW$T$57
    3097              
    3098              
    3099              $C$DW$T$58      .dwtag  DW_TAG_union_type
    3100                      .dwattr $C$DW$T$58, DW_AT_name("SDDATA2_REG")
    3101                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x02)
    3102              $C$DW$189       .dwtag  DW_TAG_member
    3103                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$55)
    3104                      .dwattr $C$DW$189, DW_AT_name("all")
    3105                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_all")
    3106                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3107                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3108              
    3109              $C$DW$190       .dwtag  DW_TAG_member
    3110                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$57)
    3111                      .dwattr $C$DW$190, DW_AT_name("bit")
    3112                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_bit")
    3113                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3114                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3115              
    3116                      .dwendtag $C$DW$T$58
    3117              
    3118              
    3119              $C$DW$T$59      .dwtag  DW_TAG_structure_type
    3120                      .dwattr $C$DW$T$59, DW_AT_name("SDDATA3_BITS")
    3121                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x02)
    3122              $C$DW$191       .dwtag  DW_TAG_member
    3123                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    3124                      .dwattr $C$DW$191, DW_AT_name("DATA16")
    3125                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_DATA16")
    3126                      .dwattr $C$DW$191, DW_AT_bit_offset(0x00)
    3127                      .dwattr $C$DW$191, DW_AT_bit_size(0x10)
    3128                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3129                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3130              
    3131              $C$DW$192       .dwtag  DW_TAG_member
    3132                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3133                      .dwattr $C$DW$192, DW_AT_name("DATA32HI")
    3134                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_DATA32HI")
    3135                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00)
    3136                      .dwattr $C$DW$192, DW_AT_bit_size(0x10)
    3137                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3138                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3139              
    3140                      .dwendtag $C$DW$T$59
    3141              
    3142              
    3143              $C$DW$T$60      .dwtag  DW_TAG_union_type
    3144                      .dwattr $C$DW$T$60, DW_AT_name("SDDATA3_REG")
    3145                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x02)
    3146              $C$DW$193       .dwtag  DW_TAG_member
    3147                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$55)
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   63

    3148                      .dwattr $C$DW$193, DW_AT_name("all")
    3149                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_all")
    3150                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3151                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3152              
    3153              $C$DW$194       .dwtag  DW_TAG_member
    3154                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$59)
    3155                      .dwattr $C$DW$194, DW_AT_name("bit")
    3156                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_bit")
    3157                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3158                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3159              
    3160                      .dwendtag $C$DW$T$60
    3161              
    3162              
    3163              $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3164                      .dwattr $C$DW$T$61, DW_AT_name("SDDATA4_BITS")
    3165                      .dwattr $C$DW$T$61, DW_AT_byte_size(0x02)
    3166              $C$DW$195       .dwtag  DW_TAG_member
    3167                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    3168                      .dwattr $C$DW$195, DW_AT_name("DATA16")
    3169                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_DATA16")
    3170                      .dwattr $C$DW$195, DW_AT_bit_offset(0x00)
    3171                      .dwattr $C$DW$195, DW_AT_bit_size(0x10)
    3172                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3173                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3174              
    3175              $C$DW$196       .dwtag  DW_TAG_member
    3176                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    3177                      .dwattr $C$DW$196, DW_AT_name("DATA32HI")
    3178                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_DATA32HI")
    3179                      .dwattr $C$DW$196, DW_AT_bit_offset(0x00)
    3180                      .dwattr $C$DW$196, DW_AT_bit_size(0x10)
    3181                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3182                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3183              
    3184                      .dwendtag $C$DW$T$61
    3185              
    3186              
    3187              $C$DW$T$62      .dwtag  DW_TAG_union_type
    3188                      .dwattr $C$DW$T$62, DW_AT_name("SDDATA4_REG")
    3189                      .dwattr $C$DW$T$62, DW_AT_byte_size(0x02)
    3190              $C$DW$197       .dwtag  DW_TAG_member
    3191                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$55)
    3192                      .dwattr $C$DW$197, DW_AT_name("all")
    3193                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_all")
    3194                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3195                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3196              
    3197              $C$DW$198       .dwtag  DW_TAG_member
    3198                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$61)
    3199                      .dwattr $C$DW$198, DW_AT_name("bit")
    3200                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_bit")
    3201                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3202                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   64

    3203              
    3204                      .dwendtag $C$DW$T$62
    3205              
    3206              
    3207              $C$DW$T$63      .dwtag  DW_TAG_structure_type
    3208                      .dwattr $C$DW$T$63, DW_AT_name("SDDFPARM1_BITS")
    3209                      .dwattr $C$DW$T$63, DW_AT_byte_size(0x01)
    3210              $C$DW$199       .dwtag  DW_TAG_member
    3211                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    3212                      .dwattr $C$DW$199, DW_AT_name("DOSR")
    3213                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_DOSR")
    3214                      .dwattr $C$DW$199, DW_AT_bit_offset(0x08)
    3215                      .dwattr $C$DW$199, DW_AT_bit_size(0x08)
    3216                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3217                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3218              
    3219              $C$DW$200       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    3221                      .dwattr $C$DW$200, DW_AT_name("FEN")
    3222                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_FEN")
    3223                      .dwattr $C$DW$200, DW_AT_bit_offset(0x07)
    3224                      .dwattr $C$DW$200, DW_AT_bit_size(0x01)
    3225                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3226                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3227              
    3228              $C$DW$201       .dwtag  DW_TAG_member
    3229                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    3230                      .dwattr $C$DW$201, DW_AT_name("AE")
    3231                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_AE")
    3232                      .dwattr $C$DW$201, DW_AT_bit_offset(0x06)
    3233                      .dwattr $C$DW$201, DW_AT_bit_size(0x01)
    3234                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3235                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3236              
    3237              $C$DW$202       .dwtag  DW_TAG_member
    3238                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    3239                      .dwattr $C$DW$202, DW_AT_name("SST")
    3240                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_SST")
    3241                      .dwattr $C$DW$202, DW_AT_bit_offset(0x04)
    3242                      .dwattr $C$DW$202, DW_AT_bit_size(0x02)
    3243                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3244                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3245              
    3246              $C$DW$203       .dwtag  DW_TAG_member
    3247                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    3248                      .dwattr $C$DW$203, DW_AT_name("FILRESEN")
    3249                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_FILRESEN")
    3250                      .dwattr $C$DW$203, DW_AT_bit_offset(0x03)
    3251                      .dwattr $C$DW$203, DW_AT_bit_size(0x01)
    3252                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3253                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3254              
    3255              $C$DW$204       .dwtag  DW_TAG_member
    3256                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    3257                      .dwattr $C$DW$204, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   65

    3258                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd1")
    3259                      .dwattr $C$DW$204, DW_AT_bit_offset(0x00)
    3260                      .dwattr $C$DW$204, DW_AT_bit_size(0x03)
    3261                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3262                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3263              
    3264                      .dwendtag $C$DW$T$63
    3265              
    3266              
    3267              $C$DW$T$64      .dwtag  DW_TAG_union_type
    3268                      .dwattr $C$DW$T$64, DW_AT_name("SDDFPARM1_REG")
    3269                      .dwattr $C$DW$T$64, DW_AT_byte_size(0x01)
    3270              $C$DW$205       .dwtag  DW_TAG_member
    3271                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3272                      .dwattr $C$DW$205, DW_AT_name("all")
    3273                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_all")
    3274                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3275                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3276              
    3277              $C$DW$206       .dwtag  DW_TAG_member
    3278                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$63)
    3279                      .dwattr $C$DW$206, DW_AT_name("bit")
    3280                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_bit")
    3281                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3282                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3283              
    3284                      .dwendtag $C$DW$T$64
    3285              
    3286              
    3287              $C$DW$T$65      .dwtag  DW_TAG_structure_type
    3288                      .dwattr $C$DW$T$65, DW_AT_name("SDDFPARM2_BITS")
    3289                      .dwattr $C$DW$T$65, DW_AT_byte_size(0x01)
    3290              $C$DW$207       .dwtag  DW_TAG_member
    3291                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3292                      .dwattr $C$DW$207, DW_AT_name("DOSR")
    3293                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_DOSR")
    3294                      .dwattr $C$DW$207, DW_AT_bit_offset(0x08)
    3295                      .dwattr $C$DW$207, DW_AT_bit_size(0x08)
    3296                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3297                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3298              
    3299              $C$DW$208       .dwtag  DW_TAG_member
    3300                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    3301                      .dwattr $C$DW$208, DW_AT_name("FEN")
    3302                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_FEN")
    3303                      .dwattr $C$DW$208, DW_AT_bit_offset(0x07)
    3304                      .dwattr $C$DW$208, DW_AT_bit_size(0x01)
    3305                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3306                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3307              
    3308              $C$DW$209       .dwtag  DW_TAG_member
    3309                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    3310                      .dwattr $C$DW$209, DW_AT_name("AE")
    3311                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_AE")
    3312                      .dwattr $C$DW$209, DW_AT_bit_offset(0x06)
TMS320C2000 Assembler PC v21.6.0 Thu Jan 20 17:49:13 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
F2837xD_sdfm_drivers.asm                                             PAGE   66

    3313                      .dwattr $C$DW$209, DW_AT_bit_size(0x01)
    3314                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3315                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3316              
    3317              $C$DW$210       .dwtag  DW_TAG_member
    3318                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3319                      .dwattr $C$DW$210, DW_AT_name("SST")
    3320                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_SST")
    3321                      .dwattr $C$DW$210, DW_AT_bit_offset(0x04)
    3322                      .dwattr $C$DW$210, DW_AT_bit_size(0x02)
    3323                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3324                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3325              
