TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v21.6.0.LTS *
       3              ;* Date/Time created: Sun Jan 23 21:55:02 2022                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --cla_support=cla0 --float_support=fpu32 --hll_source=on --mem_model:cod
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../IDDK_MuratV3.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v21.6.0.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\controlSUITE\development_kits\TMDSIDDK_v1.0\IDDK_PM_Servo_F28
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    7160 0000028e 0003          POP       AR1H:AR0H             ; [CPU_ALU] 
    7161                      .dwcfi  cfa_offset, -4
    7162                      .dwcfi  restore_reg, 5
    7163                      .dwcfi  restore_reg, 7
    7164 0000028f 3B30          SETC      INTM, DBGM            ; [CPU_ALU] 
    7165 00000290 FFF1          POP       RB                    ; [CPU_FPU] 
    7166                      .dwcfi  cfa_offset, -2
    7167                      .dwcfi  restore_reg, 74
    7168 00000291 7617          NASP      ; [CPU_ALU] 
    7169              $C$DW$345       .dwtag  DW_TAG_TI_branch
    7170                      .dwattr $C$DW$345, DW_AT_low_pc(0x00)
    7171                      .dwattr $C$DW$345, DW_AT_TI_return
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  157

    7172              
    7173 00000292 7602          IRET      ; [CPU_ALU] 
    7174                      ; return occurs ; [] 
    7175                      .dwattr $C$DW$341, DW_AT_TI_end_file("../IDDK_MuratV3.c")
    7176                      .dwattr $C$DW$341, DW_AT_TI_end_line(0x80f)
    7177                      .dwattr $C$DW$341, DW_AT_TI_end_column(0x01)
    7178                      .dwendentry
    7179                      .dwendtag $C$DW$341
    7180              
    7181              ;**************************************************************
    7182              ;* UNDEFINED EXTERNAL REFERENCES                              *
    7183              ;**************************************************************
    7184                      .global _InitSysCtrl
    7185                      .global _InitPieCtrl
    7186                      .global _InitPieVectTable
    7187                      .global _InitEPwm1Gpio
    7188                      .global _InitEPwm2Gpio
    7189                      .global _InitEPwm3Gpio
    7190                      .global _InitEPwm4Gpio
    7191                      .global _InitEPwm5Gpio
    7192                      .global _DLOG_4CH_F_init
    7193                      .global _GPIO_SetupPinOptions
    7194                      .global _GPIO_SetupPinMux
    7195                      .global _Sdfm_configureInputCtrl
    7196                      .global _Sdfm_configureComparator
    7197                      .global _Sdfm_configureData_filter
    7198                      .global _Sdfm_configureExternalreset
    7199                      .global _Sdfm_enableMFE
    7200                      .global _baseParamsInit
    7201                      .global _derivParamsCal
    7202                      .global _init_resolver_Float
    7203                      .global _ResolverISR
    7204                      .global _F28x_usDelay
    7205                      .global _DLOG_4CH_F_FUNC
    7206                      .global _floor
    7207                      .global _TrigRegs
    7208                      .global _CpuTimer0Regs
    7209                      .global _CpuTimer1Regs
    7210                      .global _CpuTimer2Regs
    7211                      .global _DacaRegs
    7212                      .global _DacbRegs
    7213                      .global _DaccRegs
    7214                      .global _AdcaResultRegs
    7215                      .global _AdcbResultRegs
    7216                      .global _AdccResultRegs
    7217                      .global _AdcdResultRegs
    7218                      .global _PieCtrlRegs
    7219                      .global _Cmpss1Regs
    7220                      .global _Cmpss2Regs
    7221                      .global _Cmpss3Regs
    7222                      .global _Cmpss6Regs
    7223                      .global _EQep1Regs
    7224                      .global _EQep2Regs
    7225                      .global _GpioDataRegs
    7226                      .global _ClkCfgRegs
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  158

    7227                      .global _AdcaRegs
    7228                      .global _AdcbRegs
    7229                      .global _AdccRegs
    7230                      .global _AdcdRegs
    7231                      .global _Sdfm1Regs
    7232                      .global _Sdfm2Regs
    7233                      .global _CpuSysRegs
    7234                      .global _EPwm1Regs
    7235                      .global _EPwm2Regs
    7236                      .global _EPwm3Regs
    7237                      .global _EPwm4Regs
    7238                      .global _EPwm5Regs
    7239                      .global _EPwm6Regs
    7240                      .global _EPwm7Regs
    7241                      .global _EPwm8Regs
    7242                      .global _EPwm9Regs
    7243                      .global _EPwm10Regs
    7244                      .global _EPwm11Regs
    7245                      .global _EPwm12Regs
    7246                      .global _PieVectTable
    7247              
    7248              ;***************************************************************
    7249              ;* TYPE INFORMATION                                            *
    7250              ;***************************************************************
    7251              
    7252              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    7253                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x1a)
    7254              $C$DW$346       .dwtag  DW_TAG_member
    7255                      .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$20)
    7256                      .dwattr $C$DW$346, DW_AT_name("input_ptr1")
    7257                      .dwattr $C$DW$346, DW_AT_TI_symbol_name("_input_ptr1")
    7258                      .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7259                      .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    7260              
    7261              $C$DW$347       .dwtag  DW_TAG_member
    7262                      .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$20)
    7263                      .dwattr $C$DW$347, DW_AT_name("input_ptr2")
    7264                      .dwattr $C$DW$347, DW_AT_TI_symbol_name("_input_ptr2")
    7265                      .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7266                      .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    7267              
    7268              $C$DW$348       .dwtag  DW_TAG_member
    7269                      .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$20)
    7270                      .dwattr $C$DW$348, DW_AT_name("input_ptr3")
    7271                      .dwattr $C$DW$348, DW_AT_TI_symbol_name("_input_ptr3")
    7272                      .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7273                      .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    7274              
    7275              $C$DW$349       .dwtag  DW_TAG_member
    7276                      .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$20)
    7277                      .dwattr $C$DW$349, DW_AT_name("input_ptr4")
    7278                      .dwattr $C$DW$349, DW_AT_TI_symbol_name("_input_ptr4")
    7279                      .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7280                      .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    7281              
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  159

    7282              $C$DW$350       .dwtag  DW_TAG_member
    7283                      .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$20)
    7284                      .dwattr $C$DW$350, DW_AT_name("output_ptr1")
    7285                      .dwattr $C$DW$350, DW_AT_TI_symbol_name("_output_ptr1")
    7286                      .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7287                      .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    7288              
    7289              $C$DW$351       .dwtag  DW_TAG_member
    7290                      .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$20)
    7291                      .dwattr $C$DW$351, DW_AT_name("output_ptr2")
    7292                      .dwattr $C$DW$351, DW_AT_TI_symbol_name("_output_ptr2")
    7293                      .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7294                      .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    7295              
    7296              $C$DW$352       .dwtag  DW_TAG_member
    7297                      .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$20)
    7298                      .dwattr $C$DW$352, DW_AT_name("output_ptr3")
    7299                      .dwattr $C$DW$352, DW_AT_TI_symbol_name("_output_ptr3")
    7300                      .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7301                      .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    7302              
    7303              $C$DW$353       .dwtag  DW_TAG_member
    7304                      .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$20)
    7305                      .dwattr $C$DW$353, DW_AT_name("output_ptr4")
    7306                      .dwattr $C$DW$353, DW_AT_TI_symbol_name("_output_ptr4")
    7307                      .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7308                      .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    7309              
    7310              $C$DW$354       .dwtag  DW_TAG_member
    7311                      .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$19)
    7312                      .dwattr $C$DW$354, DW_AT_name("prev_value")
    7313                      .dwattr $C$DW$354, DW_AT_TI_symbol_name("_prev_value")
    7314                      .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7315                      .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    7316              
    7317              $C$DW$355       .dwtag  DW_TAG_member
    7318                      .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$19)
    7319                      .dwattr $C$DW$355, DW_AT_name("trig_value")
    7320                      .dwattr $C$DW$355, DW_AT_TI_symbol_name("_trig_value")
    7321                      .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7322                      .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    7323              
    7324              $C$DW$356       .dwtag  DW_TAG_member
    7325                      .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$21)
    7326                      .dwattr $C$DW$356, DW_AT_name("status")
    7327                      .dwattr $C$DW$356, DW_AT_TI_symbol_name("_status")
    7328                      .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7329                      .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    7330              
    7331              $C$DW$357       .dwtag  DW_TAG_member
    7332                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$21)
    7333                      .dwattr $C$DW$357, DW_AT_name("pre_scalar")
    7334                      .dwattr $C$DW$357, DW_AT_TI_symbol_name("_pre_scalar")
    7335                      .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    7336                      .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  160

    7337              
    7338              $C$DW$358       .dwtag  DW_TAG_member
    7339                      .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$21)
    7340                      .dwattr $C$DW$358, DW_AT_name("skip_count")
    7341                      .dwattr $C$DW$358, DW_AT_TI_symbol_name("_skip_count")
    7342                      .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7343                      .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    7344              
    7345              $C$DW$359       .dwtag  DW_TAG_member
    7346                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$21)
    7347                      .dwattr $C$DW$359, DW_AT_name("size")
    7348                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_size")
    7349                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    7350                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    7351              
    7352              $C$DW$360       .dwtag  DW_TAG_member
    7353                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$21)
    7354                      .dwattr $C$DW$360, DW_AT_name("count")
    7355                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_count")
    7356                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7357                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    7358              
    7359                      .dwendtag $C$DW$T$22
    7360              
    7361              $C$DW$T$658     .dwtag  DW_TAG_typedef
    7362                      .dwattr $C$DW$T$658, DW_AT_name("DLOG_4CH_F")
    7363                      .dwattr $C$DW$T$658, DW_AT_type(*$C$DW$T$22)
    7364                      .dwattr $C$DW$T$658, DW_AT_language(DW_LANG_C)
    7365              
    7366              $C$DW$T$659     .dwtag  DW_TAG_pointer_type
    7367                      .dwattr $C$DW$T$659, DW_AT_type(*$C$DW$T$658)
    7368                      .dwattr $C$DW$T$659, DW_AT_address_class(0x20)
    7369              
    7370              
    7371              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    7372                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x06)
    7373              $C$DW$361       .dwtag  DW_TAG_member
    7374                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$16)
    7375                      .dwattr $C$DW$361, DW_AT_name("As")
    7376                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_As")
    7377                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7378                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    7379              
    7380              $C$DW$362       .dwtag  DW_TAG_member
    7381                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$16)
    7382                      .dwattr $C$DW$362, DW_AT_name("Bs")
    7383                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_Bs")
    7384                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7385                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    7386              
    7387              $C$DW$363       .dwtag  DW_TAG_member
    7388                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$16)
    7389                      .dwattr $C$DW$363, DW_AT_name("Cs")
    7390                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_Cs")
    7391                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  161

    7392                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    7393              
    7394                      .dwendtag $C$DW$T$23
    7395              
    7396              $C$DW$T$661     .dwtag  DW_TAG_typedef
    7397                      .dwattr $C$DW$T$661, DW_AT_name("CURRENT_SENSOR")
    7398                      .dwattr $C$DW$T$661, DW_AT_type(*$C$DW$T$23)
    7399                      .dwattr $C$DW$T$661, DW_AT_language(DW_LANG_C)
    7400              
    7401              
    7402              $C$DW$T$662     .dwtag  DW_TAG_array_type
    7403                      .dwattr $C$DW$T$662, DW_AT_type(*$C$DW$T$661)
    7404                      .dwattr $C$DW$T$662, DW_AT_language(DW_LANG_C)
    7405                      .dwattr $C$DW$T$662, DW_AT_byte_size(0x12)
    7406              $C$DW$364       .dwtag  DW_TAG_subrange_type
    7407                      .dwattr $C$DW$364, DW_AT_upper_bound(0x02)
    7408              
    7409                      .dwendtag $C$DW$T$662
    7410              
    7411              
    7412              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    7413                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x0a)
    7414              $C$DW$365       .dwtag  DW_TAG_member
    7415                      .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$24)
    7416                      .dwattr $C$DW$365, DW_AT_name("As")
    7417                      .dwattr $C$DW$365, DW_AT_TI_symbol_name("_As")
    7418                      .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7419                      .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    7420              
    7421              $C$DW$366       .dwtag  DW_TAG_member
    7422                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$24)
    7423                      .dwattr $C$DW$366, DW_AT_name("Bs")
    7424                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_Bs")
    7425                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7426                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    7427              
    7428              $C$DW$367       .dwtag  DW_TAG_member
    7429                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$24)
    7430                      .dwattr $C$DW$367, DW_AT_name("Cs")
    7431                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_Cs")
    7432                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7433                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    7434              
    7435              $C$DW$368       .dwtag  DW_TAG_member
    7436                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$24)
    7437                      .dwattr $C$DW$368, DW_AT_name("Alpha")
    7438                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_Alpha")
    7439                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7440                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    7441              
    7442              $C$DW$369       .dwtag  DW_TAG_member
    7443                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$24)
    7444                      .dwattr $C$DW$369, DW_AT_name("Beta")
    7445                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_Beta")
    7446                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  162

    7447                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    7448              
    7449                      .dwendtag $C$DW$T$25
    7450              
    7451              $C$DW$T$665     .dwtag  DW_TAG_typedef
    7452                      .dwattr $C$DW$T$665, DW_AT_name("CLARKE")
    7453                      .dwattr $C$DW$T$665, DW_AT_type(*$C$DW$T$25)
    7454                      .dwattr $C$DW$T$665, DW_AT_language(DW_LANG_C)
    7455              
    7456              
    7457              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    7458                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0e)
    7459              $C$DW$370       .dwtag  DW_TAG_member
    7460                      .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$24)
    7461                      .dwattr $C$DW$370, DW_AT_name("Alpha")
    7462                      .dwattr $C$DW$370, DW_AT_TI_symbol_name("_Alpha")
    7463                      .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7464                      .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    7465              
    7466              $C$DW$371       .dwtag  DW_TAG_member
    7467                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$24)
    7468                      .dwattr $C$DW$371, DW_AT_name("Beta")
    7469                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_Beta")
    7470                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7471                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    7472              
    7473              $C$DW$372       .dwtag  DW_TAG_member
    7474                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$24)
    7475                      .dwattr $C$DW$372, DW_AT_name("Angle")
    7476                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_Angle")
    7477                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7478                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    7479              
    7480              $C$DW$373       .dwtag  DW_TAG_member
    7481                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$24)
    7482                      .dwattr $C$DW$373, DW_AT_name("Ds")
    7483                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_Ds")
    7484                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7485                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    7486              
    7487              $C$DW$374       .dwtag  DW_TAG_member
    7488                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$24)
    7489                      .dwattr $C$DW$374, DW_AT_name("Qs")
    7490                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_Qs")
    7491                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7492                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    7493              
    7494              $C$DW$375       .dwtag  DW_TAG_member
    7495                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$24)
    7496                      .dwattr $C$DW$375, DW_AT_name("Sine")
    7497                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_Sine")
    7498                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7499                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    7500              
    7501              $C$DW$376       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  163

    7502                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$24)
    7503                      .dwattr $C$DW$376, DW_AT_name("Cosine")
    7504                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_Cosine")
    7505                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7506                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    7507              
    7508                      .dwendtag $C$DW$T$26
    7509              
    7510              $C$DW$T$666     .dwtag  DW_TAG_typedef
    7511                      .dwattr $C$DW$T$666, DW_AT_name("PARK")
    7512                      .dwattr $C$DW$T$666, DW_AT_type(*$C$DW$T$26)
    7513                      .dwattr $C$DW$T$666, DW_AT_language(DW_LANG_C)
    7514              
    7515              
    7516              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    7517                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0e)
    7518              $C$DW$377       .dwtag  DW_TAG_member
    7519                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$24)
    7520                      .dwattr $C$DW$377, DW_AT_name("Alpha")
    7521                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_Alpha")
    7522                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7523                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    7524              
    7525              $C$DW$378       .dwtag  DW_TAG_member
    7526                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$24)
    7527                      .dwattr $C$DW$378, DW_AT_name("Beta")
    7528                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_Beta")
    7529                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7530                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    7531              
    7532              $C$DW$379       .dwtag  DW_TAG_member
    7533                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$24)
    7534                      .dwattr $C$DW$379, DW_AT_name("Angle")
    7535                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_Angle")
    7536                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7537                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    7538              
    7539              $C$DW$380       .dwtag  DW_TAG_member
    7540                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$24)
    7541                      .dwattr $C$DW$380, DW_AT_name("Ds")
    7542                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_Ds")
    7543                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7544                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    7545              
    7546              $C$DW$381       .dwtag  DW_TAG_member
    7547                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$24)
    7548                      .dwattr $C$DW$381, DW_AT_name("Qs")
    7549                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_Qs")
    7550                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7551                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    7552              
    7553              $C$DW$382       .dwtag  DW_TAG_member
    7554                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$24)
    7555                      .dwattr $C$DW$382, DW_AT_name("Sine")
    7556                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_Sine")
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  164

    7557                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7558                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    7559              
    7560              $C$DW$383       .dwtag  DW_TAG_member
    7561                      .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$24)
    7562                      .dwattr $C$DW$383, DW_AT_name("Cosine")
    7563                      .dwattr $C$DW$383, DW_AT_TI_symbol_name("_Cosine")
    7564                      .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7565                      .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    7566              
    7567                      .dwendtag $C$DW$T$27
    7568              
    7569              $C$DW$T$667     .dwtag  DW_TAG_typedef
    7570                      .dwattr $C$DW$T$667, DW_AT_name("IPARK")
    7571                      .dwattr $C$DW$T$667, DW_AT_type(*$C$DW$T$27)
    7572                      .dwattr $C$DW$T$667, DW_AT_language(DW_LANG_C)
    7573              
    7574              
    7575              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    7576                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x20)
    7577              $C$DW$384       .dwtag  DW_TAG_member
    7578                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$24)
    7579                      .dwattr $C$DW$384, DW_AT_name("Ref")
    7580                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_Ref")
    7581                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7582                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    7583              
    7584              $C$DW$385       .dwtag  DW_TAG_member
    7585                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$24)
    7586                      .dwattr $C$DW$385, DW_AT_name("Fdb")
    7587                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_Fdb")
    7588                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7589                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    7590              
    7591              $C$DW$386       .dwtag  DW_TAG_member
    7592                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$24)
    7593                      .dwattr $C$DW$386, DW_AT_name("Err")
    7594                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_Err")
    7595                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7596                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    7597              
    7598              $C$DW$387       .dwtag  DW_TAG_member
    7599                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$24)
    7600                      .dwattr $C$DW$387, DW_AT_name("Kp")
    7601                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_Kp")
    7602                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7603                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    7604              
    7605              $C$DW$388       .dwtag  DW_TAG_member
    7606                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$24)
    7607                      .dwattr $C$DW$388, DW_AT_name("Up")
    7608                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_Up")
    7609                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7610                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    7611              
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  165

    7612              $C$DW$389       .dwtag  DW_TAG_member
    7613                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$24)
    7614                      .dwattr $C$DW$389, DW_AT_name("Ui")
    7615                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_Ui")
    7616                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7617                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    7618              
    7619              $C$DW$390       .dwtag  DW_TAG_member
    7620                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$24)
    7621                      .dwattr $C$DW$390, DW_AT_name("Ud")
    7622                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_Ud")
    7623                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7624                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    7625              
    7626              $C$DW$391       .dwtag  DW_TAG_member
    7627                      .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$24)
    7628                      .dwattr $C$DW$391, DW_AT_name("OutPreSat")
    7629                      .dwattr $C$DW$391, DW_AT_TI_symbol_name("_OutPreSat")
    7630                      .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7631                      .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    7632              
    7633              $C$DW$392       .dwtag  DW_TAG_member
    7634                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$24)
    7635                      .dwattr $C$DW$392, DW_AT_name("OutMax")
    7636                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_OutMax")
    7637                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7638                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    7639              
    7640              $C$DW$393       .dwtag  DW_TAG_member
    7641                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$24)
    7642                      .dwattr $C$DW$393, DW_AT_name("OutMin")
    7643                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_OutMin")
    7644                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7645                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    7646              
    7647              $C$DW$394       .dwtag  DW_TAG_member
    7648                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$24)
    7649                      .dwattr $C$DW$394, DW_AT_name("Out")
    7650                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_Out")
    7651                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7652                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    7653              
    7654              $C$DW$395       .dwtag  DW_TAG_member
    7655                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$24)
    7656                      .dwattr $C$DW$395, DW_AT_name("SatErr")
    7657                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_SatErr")
    7658                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7659                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    7660              
    7661              $C$DW$396       .dwtag  DW_TAG_member
    7662                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$24)
    7663                      .dwattr $C$DW$396, DW_AT_name("Ki")
    7664                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_Ki")
    7665                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7666                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  166

    7667              
    7668              $C$DW$397       .dwtag  DW_TAG_member
    7669                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$24)
    7670                      .dwattr $C$DW$397, DW_AT_name("Kc")
    7671                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_Kc")
    7672                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7673                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    7674              
    7675              $C$DW$398       .dwtag  DW_TAG_member
    7676                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$24)
    7677                      .dwattr $C$DW$398, DW_AT_name("Kd")
    7678                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_Kd")
    7679                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7680                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    7681              
    7682              $C$DW$399       .dwtag  DW_TAG_member
    7683                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$24)
    7684                      .dwattr $C$DW$399, DW_AT_name("Up1")
    7685                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_Up1")
    7686                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7687                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    7688              
    7689                      .dwendtag $C$DW$T$28
    7690              
    7691              $C$DW$T$668     .dwtag  DW_TAG_typedef
    7692                      .dwattr $C$DW$T$668, DW_AT_name("PIDREG3")
    7693                      .dwattr $C$DW$T$668, DW_AT_type(*$C$DW$T$28)
    7694                      .dwattr $C$DW$T$668, DW_AT_language(DW_LANG_C)
    7695              
    7696              
    7697              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    7698                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x18)
    7699              $C$DW$400       .dwtag  DW_TAG_member
    7700                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$24)
    7701                      .dwattr $C$DW$400, DW_AT_name("Ref")
    7702                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_Ref")
    7703                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7704                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    7705              
    7706              $C$DW$401       .dwtag  DW_TAG_member
    7707                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$24)
    7708                      .dwattr $C$DW$401, DW_AT_name("Fbk")
    7709                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_Fbk")
    7710                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7711                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    7712              
    7713              $C$DW$402       .dwtag  DW_TAG_member
    7714                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$24)
    7715                      .dwattr $C$DW$402, DW_AT_name("Out")
    7716                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_Out")
    7717                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7718                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    7719              
    7720              $C$DW$403       .dwtag  DW_TAG_member
    7721                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$24)
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  167

    7722                      .dwattr $C$DW$403, DW_AT_name("Kp")
    7723                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_Kp")
    7724                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7725                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    7726              
    7727              $C$DW$404       .dwtag  DW_TAG_member
    7728                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$24)
    7729                      .dwattr $C$DW$404, DW_AT_name("Ki")
    7730                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_Ki")
    7731                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7732                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    7733              
    7734              $C$DW$405       .dwtag  DW_TAG_member
    7735                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$24)
    7736                      .dwattr $C$DW$405, DW_AT_name("Umax")
    7737                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_Umax")
    7738                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7739                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    7740              
    7741              $C$DW$406       .dwtag  DW_TAG_member
    7742                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$24)
    7743                      .dwattr $C$DW$406, DW_AT_name("Umin")
    7744                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_Umin")
    7745                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7746                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    7747              
    7748              $C$DW$407       .dwtag  DW_TAG_member
    7749                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$24)
    7750                      .dwattr $C$DW$407, DW_AT_name("up")
    7751                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_up")
    7752                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7753                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    7754              
    7755              $C$DW$408       .dwtag  DW_TAG_member
    7756                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$24)
    7757                      .dwattr $C$DW$408, DW_AT_name("ui")
    7758                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_ui")
    7759                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7760                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    7761              
    7762              $C$DW$409       .dwtag  DW_TAG_member
    7763                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$24)
    7764                      .dwattr $C$DW$409, DW_AT_name("v1")
    7765                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_v1")
    7766                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7767                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    7768              
    7769              $C$DW$410       .dwtag  DW_TAG_member
    7770                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$24)
    7771                      .dwattr $C$DW$410, DW_AT_name("i1")
    7772                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_i1")
    7773                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7774                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    7775              
    7776              $C$DW$411       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  168

    7777                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$24)
    7778                      .dwattr $C$DW$411, DW_AT_name("w1")
    7779                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_w1")
    7780                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    7781                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    7782              
    7783                      .dwendtag $C$DW$T$29
    7784              
    7785              $C$DW$T$669     .dwtag  DW_TAG_typedef
    7786                      .dwattr $C$DW$T$669, DW_AT_name("PI_CONTROLLER")
    7787                      .dwattr $C$DW$T$669, DW_AT_type(*$C$DW$T$29)
    7788                      .dwattr $C$DW$T$669, DW_AT_language(DW_LANG_C)
    7789              
    7790              
    7791              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    7792                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0a)
    7793              $C$DW$412       .dwtag  DW_TAG_member
    7794                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$24)
    7795                      .dwattr $C$DW$412, DW_AT_name("Ref")
    7796                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_Ref")
    7797                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7798                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    7799              
    7800              $C$DW$413       .dwtag  DW_TAG_member
    7801                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$24)
    7802                      .dwattr $C$DW$413, DW_AT_name("Fbk")
    7803                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_Fbk")
    7804                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7805                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    7806              
    7807              $C$DW$414       .dwtag  DW_TAG_member
    7808                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$24)
    7809                      .dwattr $C$DW$414, DW_AT_name("Out")
    7810                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_Out")
    7811                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7812                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    7813              
    7814              $C$DW$415       .dwtag  DW_TAG_member
    7815                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$24)
    7816                      .dwattr $C$DW$415, DW_AT_name("c1")
    7817                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_c1")
    7818                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7819                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    7820              
    7821              $C$DW$416       .dwtag  DW_TAG_member
    7822                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$24)
    7823                      .dwattr $C$DW$416, DW_AT_name("c2")
    7824                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_c2")
    7825                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7826                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    7827              
    7828                      .dwendtag $C$DW$T$30
    7829              
    7830              $C$DW$T$33      .dwtag  DW_TAG_typedef
    7831                      .dwattr $C$DW$T$33, DW_AT_name("PID_TERMINALS")
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  169

    7832                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$30)
    7833                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    7834              
    7835              
    7836              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    7837                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x0e)
    7838              $C$DW$417       .dwtag  DW_TAG_member
    7839                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$24)
    7840                      .dwattr $C$DW$417, DW_AT_name("Kr")
    7841                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_Kr")
    7842                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7843                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    7844              
    7845              $C$DW$418       .dwtag  DW_TAG_member
    7846                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$24)
    7847                      .dwattr $C$DW$418, DW_AT_name("Kp")
    7848                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_Kp")
    7849                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7850                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    7851              
    7852              $C$DW$419       .dwtag  DW_TAG_member
    7853                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$24)
    7854                      .dwattr $C$DW$419, DW_AT_name("Ki")
    7855                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_Ki")
    7856                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7857                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    7858              
    7859              $C$DW$420       .dwtag  DW_TAG_member
    7860                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$24)
    7861                      .dwattr $C$DW$420, DW_AT_name("Kd")
    7862                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_Kd")
    7863                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7864                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    7865              
    7866              $C$DW$421       .dwtag  DW_TAG_member
    7867                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$24)
    7868                      .dwattr $C$DW$421, DW_AT_name("Km")
    7869                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_Km")
    7870                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7871                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    7872              
    7873              $C$DW$422       .dwtag  DW_TAG_member
    7874                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$24)
    7875                      .dwattr $C$DW$422, DW_AT_name("Umax")
    7876                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_Umax")
    7877                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7878                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    7879              
    7880              $C$DW$423       .dwtag  DW_TAG_member
    7881                      .dwattr $C$DW$423, DW_AT_type(*$C$DW$T$24)
    7882                      .dwattr $C$DW$423, DW_AT_name("Umin")
    7883                      .dwattr $C$DW$423, DW_AT_TI_symbol_name("_Umin")
    7884                      .dwattr $C$DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7885                      .dwattr $C$DW$423, DW_AT_accessibility(DW_ACCESS_public)
    7886              
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  170

    7887                      .dwendtag $C$DW$T$31
    7888              
    7889              $C$DW$T$34      .dwtag  DW_TAG_typedef
    7890                      .dwattr $C$DW$T$34, DW_AT_name("PID_PARAMETERS")
    7891                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$31)
    7892                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    7893              
    7894              
    7895              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    7896                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    7897              $C$DW$424       .dwtag  DW_TAG_member
    7898                      .dwattr $C$DW$424, DW_AT_type(*$C$DW$T$24)
    7899                      .dwattr $C$DW$424, DW_AT_name("up")
    7900                      .dwattr $C$DW$424, DW_AT_TI_symbol_name("_up")
    7901                      .dwattr $C$DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7902                      .dwattr $C$DW$424, DW_AT_accessibility(DW_ACCESS_public)
    7903              
    7904              $C$DW$425       .dwtag  DW_TAG_member
    7905                      .dwattr $C$DW$425, DW_AT_type(*$C$DW$T$24)
    7906                      .dwattr $C$DW$425, DW_AT_name("ui")
    7907                      .dwattr $C$DW$425, DW_AT_TI_symbol_name("_ui")
    7908                      .dwattr $C$DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7909                      .dwattr $C$DW$425, DW_AT_accessibility(DW_ACCESS_public)
    7910              
    7911              $C$DW$426       .dwtag  DW_TAG_member
    7912                      .dwattr $C$DW$426, DW_AT_type(*$C$DW$T$24)
    7913                      .dwattr $C$DW$426, DW_AT_name("ud")
    7914                      .dwattr $C$DW$426, DW_AT_TI_symbol_name("_ud")
    7915                      .dwattr $C$DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7916                      .dwattr $C$DW$426, DW_AT_accessibility(DW_ACCESS_public)
    7917              
    7918              $C$DW$427       .dwtag  DW_TAG_member
    7919                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$24)
    7920                      .dwattr $C$DW$427, DW_AT_name("v1")
    7921                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_v1")
    7922                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7923                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    7924              
    7925              $C$DW$428       .dwtag  DW_TAG_member
    7926                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$24)
    7927                      .dwattr $C$DW$428, DW_AT_name("i1")
    7928                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_i1")
    7929                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7930                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    7931              
    7932              $C$DW$429       .dwtag  DW_TAG_member
    7933                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$24)
    7934                      .dwattr $C$DW$429, DW_AT_name("d1")
    7935                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_d1")
    7936                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7937                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    7938              
    7939              $C$DW$430       .dwtag  DW_TAG_member
    7940                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$24)
    7941                      .dwattr $C$DW$430, DW_AT_name("d2")
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  171

    7942                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_d2")
    7943                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7944                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    7945              
    7946              $C$DW$431       .dwtag  DW_TAG_member
    7947                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$24)
    7948                      .dwattr $C$DW$431, DW_AT_name("w1")
    7949                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_w1")
    7950                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    7951                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    7952              
    7953                      .dwendtag $C$DW$T$32
    7954              
    7955              $C$DW$T$35      .dwtag  DW_TAG_typedef
    7956                      .dwattr $C$DW$T$35, DW_AT_name("PID_DATA")
    7957                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$32)
    7958                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    7959              
    7960              
    7961              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    7962                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x28)
    7963              $C$DW$432       .dwtag  DW_TAG_member
    7964                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$33)
    7965                      .dwattr $C$DW$432, DW_AT_name("term")
    7966                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_term")
    7967                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7968                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    7969              
    7970              $C$DW$433       .dwtag  DW_TAG_member
    7971                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$34)
    7972                      .dwattr $C$DW$433, DW_AT_name("param")
    7973                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_param")
    7974                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7975                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    7976              
    7977              $C$DW$434       .dwtag  DW_TAG_member
    7978                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$35)
    7979                      .dwattr $C$DW$434, DW_AT_name("data")
    7980                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_data")
    7981                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7982                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    7983              
    7984                      .dwendtag $C$DW$T$36
    7985              
    7986              $C$DW$T$670     .dwtag  DW_TAG_typedef
    7987                      .dwattr $C$DW$T$670, DW_AT_name("PID_CONTROLLER")
    7988                      .dwattr $C$DW$T$670, DW_AT_type(*$C$DW$T$36)
    7989                      .dwattr $C$DW$T$670, DW_AT_language(DW_LANG_C)
    7990              
    7991              
    7992              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    7993                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x12)
    7994              $C$DW$435       .dwtag  DW_TAG_member
    7995                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$24)
    7996                      .dwattr $C$DW$435, DW_AT_name("Ualpha")
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  172

    7997                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_Ualpha")
    7998                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7999                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    8000              
    8001              $C$DW$436       .dwtag  DW_TAG_member
    8002                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$24)
    8003                      .dwattr $C$DW$436, DW_AT_name("Ubeta")
    8004                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_Ubeta")
    8005                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8006                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    8007              
    8008              $C$DW$437       .dwtag  DW_TAG_member
    8009                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$24)
    8010                      .dwattr $C$DW$437, DW_AT_name("Ta")
    8011                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_Ta")
    8012                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8013                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    8014              
    8015              $C$DW$438       .dwtag  DW_TAG_member
    8016                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$24)
    8017                      .dwattr $C$DW$438, DW_AT_name("Tb")
    8018                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_Tb")
    8019                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8020                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    8021              
    8022              $C$DW$439       .dwtag  DW_TAG_member
    8023                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$24)
    8024                      .dwattr $C$DW$439, DW_AT_name("Tc")
    8025                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_Tc")
    8026                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8027                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    8028              
    8029              $C$DW$440       .dwtag  DW_TAG_member
    8030                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$24)
    8031                      .dwattr $C$DW$440, DW_AT_name("tmp1")
    8032                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_tmp1")
    8033                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8034                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    8035              
    8036              $C$DW$441       .dwtag  DW_TAG_member
    8037                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$24)
    8038                      .dwattr $C$DW$441, DW_AT_name("tmp2")
    8039                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_tmp2")
    8040                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8041                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    8042              
    8043              $C$DW$442       .dwtag  DW_TAG_member
    8044                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$24)
    8045                      .dwattr $C$DW$442, DW_AT_name("tmp3")
    8046                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_tmp3")
    8047                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8048                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    8049              
    8050              $C$DW$443       .dwtag  DW_TAG_member
    8051                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  173

    8052                      .dwattr $C$DW$443, DW_AT_name("VecSector")
    8053                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_VecSector")
    8054                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8055                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    8056              
    8057                      .dwendtag $C$DW$T$38
    8058              
    8059              $C$DW$T$671     .dwtag  DW_TAG_typedef
    8060                      .dwattr $C$DW$T$671, DW_AT_name("SVGEN")
    8061                      .dwattr $C$DW$T$671, DW_AT_type(*$C$DW$T$38)
    8062                      .dwattr $C$DW$T$671, DW_AT_language(DW_LANG_C)
    8063              
    8064              
    8065              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8066                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x10)
    8067              $C$DW$444       .dwtag  DW_TAG_member
    8068                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$24)
    8069                      .dwattr $C$DW$444, DW_AT_name("TargetValue")
    8070                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_TargetValue")
    8071                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8072                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    8073              
    8074              $C$DW$445       .dwtag  DW_TAG_member
    8075                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$39)
    8076                      .dwattr $C$DW$445, DW_AT_name("RampDelayMax")
    8077                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_RampDelayMax")
    8078                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8079                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    8080              
    8081              $C$DW$446       .dwtag  DW_TAG_member
    8082                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$24)
    8083                      .dwattr $C$DW$446, DW_AT_name("RampLowLimit")
    8084                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_RampLowLimit")
    8085                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8086                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    8087              
    8088              $C$DW$447       .dwtag  DW_TAG_member
    8089                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$24)
    8090                      .dwattr $C$DW$447, DW_AT_name("RampHighLimit")
    8091                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_RampHighLimit")
    8092                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8093                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    8094              
    8095              $C$DW$448       .dwtag  DW_TAG_member
    8096                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$39)
    8097                      .dwattr $C$DW$448, DW_AT_name("RampDelayCount")
    8098                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_RampDelayCount")
    8099                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8100                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    8101              
    8102              $C$DW$449       .dwtag  DW_TAG_member
    8103                      .dwattr $C$DW$449, DW_AT_type(*$C$DW$T$24)
    8104                      .dwattr $C$DW$449, DW_AT_name("SetpointValue")
    8105                      .dwattr $C$DW$449, DW_AT_TI_symbol_name("_SetpointValue")
    8106                      .dwattr $C$DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  174

    8107                      .dwattr $C$DW$449, DW_AT_accessibility(DW_ACCESS_public)
    8108              
    8109              $C$DW$450       .dwtag  DW_TAG_member
    8110                      .dwattr $C$DW$450, DW_AT_type(*$C$DW$T$39)
    8111                      .dwattr $C$DW$450, DW_AT_name("EqualFlag")
    8112                      .dwattr $C$DW$450, DW_AT_TI_symbol_name("_EqualFlag")
    8113                      .dwattr $C$DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8114                      .dwattr $C$DW$450, DW_AT_accessibility(DW_ACCESS_public)
    8115              
    8116              $C$DW$451       .dwtag  DW_TAG_member
    8117                      .dwattr $C$DW$451, DW_AT_type(*$C$DW$T$24)
    8118                      .dwattr $C$DW$451, DW_AT_name("Tmp")
    8119                      .dwattr $C$DW$451, DW_AT_TI_symbol_name("_Tmp")
    8120                      .dwattr $C$DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8121                      .dwattr $C$DW$451, DW_AT_accessibility(DW_ACCESS_public)
    8122              
    8123                      .dwendtag $C$DW$T$40
    8124              
    8125              $C$DW$T$672     .dwtag  DW_TAG_typedef
    8126                      .dwattr $C$DW$T$672, DW_AT_name("RMPCNTL")
    8127                      .dwattr $C$DW$T$672, DW_AT_type(*$C$DW$T$40)
    8128                      .dwattr $C$DW$T$672, DW_AT_language(DW_LANG_C)
    8129              
    8130              
    8131              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    8132                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x0c)
    8133              $C$DW$452       .dwtag  DW_TAG_member
    8134                      .dwattr $C$DW$452, DW_AT_type(*$C$DW$T$24)
    8135                      .dwattr $C$DW$452, DW_AT_name("Freq")
    8136                      .dwattr $C$DW$452, DW_AT_TI_symbol_name("_Freq")
    8137                      .dwattr $C$DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8138                      .dwattr $C$DW$452, DW_AT_accessibility(DW_ACCESS_public)
    8139              
    8140              $C$DW$453       .dwtag  DW_TAG_member
    8141                      .dwattr $C$DW$453, DW_AT_type(*$C$DW$T$24)
    8142                      .dwattr $C$DW$453, DW_AT_name("StepAngleMax")
    8143                      .dwattr $C$DW$453, DW_AT_TI_symbol_name("_StepAngleMax")
    8144                      .dwattr $C$DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8145                      .dwattr $C$DW$453, DW_AT_accessibility(DW_ACCESS_public)
    8146              
    8147              $C$DW$454       .dwtag  DW_TAG_member
    8148                      .dwattr $C$DW$454, DW_AT_type(*$C$DW$T$24)
    8149                      .dwattr $C$DW$454, DW_AT_name("Angle")
    8150                      .dwattr $C$DW$454, DW_AT_TI_symbol_name("_Angle")
    8151                      .dwattr $C$DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8152                      .dwattr $C$DW$454, DW_AT_accessibility(DW_ACCESS_public)
    8153              
    8154              $C$DW$455       .dwtag  DW_TAG_member
    8155                      .dwattr $C$DW$455, DW_AT_type(*$C$DW$T$24)
    8156                      .dwattr $C$DW$455, DW_AT_name("Gain")
    8157                      .dwattr $C$DW$455, DW_AT_TI_symbol_name("_Gain")
    8158                      .dwattr $C$DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8159                      .dwattr $C$DW$455, DW_AT_accessibility(DW_ACCESS_public)
    8160              
    8161              $C$DW$456       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  175

    8162                      .dwattr $C$DW$456, DW_AT_type(*$C$DW$T$24)
    8163                      .dwattr $C$DW$456, DW_AT_name("Out")
    8164                      .dwattr $C$DW$456, DW_AT_TI_symbol_name("_Out")
    8165                      .dwattr $C$DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8166                      .dwattr $C$DW$456, DW_AT_accessibility(DW_ACCESS_public)
    8167              
    8168              $C$DW$457       .dwtag  DW_TAG_member
    8169                      .dwattr $C$DW$457, DW_AT_type(*$C$DW$T$24)
    8170                      .dwattr $C$DW$457, DW_AT_name("Offset")
    8171                      .dwattr $C$DW$457, DW_AT_TI_symbol_name("_Offset")
    8172                      .dwattr $C$DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8173                      .dwattr $C$DW$457, DW_AT_accessibility(DW_ACCESS_public)
    8174              
    8175                      .dwendtag $C$DW$T$41
    8176              
    8177              $C$DW$T$673     .dwtag  DW_TAG_typedef
    8178                      .dwattr $C$DW$T$673, DW_AT_name("RAMPGEN")
    8179                      .dwattr $C$DW$T$673, DW_AT_type(*$C$DW$T$41)
    8180                      .dwattr $C$DW$T$673, DW_AT_language(DW_LANG_C)
    8181              
    8182              
    8183              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    8184                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x16)
    8185              $C$DW$458       .dwtag  DW_TAG_member
    8186                      .dwattr $C$DW$458, DW_AT_type(*$C$DW$T$24)
    8187                      .dwattr $C$DW$458, DW_AT_name("DcBusVolt")
    8188                      .dwattr $C$DW$458, DW_AT_TI_symbol_name("_DcBusVolt")
    8189                      .dwattr $C$DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8190                      .dwattr $C$DW$458, DW_AT_accessibility(DW_ACCESS_public)
    8191              
    8192              $C$DW$459       .dwtag  DW_TAG_member
    8193                      .dwattr $C$DW$459, DW_AT_type(*$C$DW$T$24)
    8194                      .dwattr $C$DW$459, DW_AT_name("MfuncV1")
    8195                      .dwattr $C$DW$459, DW_AT_TI_symbol_name("_MfuncV1")
    8196                      .dwattr $C$DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8197                      .dwattr $C$DW$459, DW_AT_accessibility(DW_ACCESS_public)
    8198              
    8199              $C$DW$460       .dwtag  DW_TAG_member
    8200                      .dwattr $C$DW$460, DW_AT_type(*$C$DW$T$24)
    8201                      .dwattr $C$DW$460, DW_AT_name("MfuncV2")
    8202                      .dwattr $C$DW$460, DW_AT_TI_symbol_name("_MfuncV2")
    8203                      .dwattr $C$DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8204                      .dwattr $C$DW$460, DW_AT_accessibility(DW_ACCESS_public)
    8205              
    8206              $C$DW$461       .dwtag  DW_TAG_member
    8207                      .dwattr $C$DW$461, DW_AT_type(*$C$DW$T$24)
    8208                      .dwattr $C$DW$461, DW_AT_name("MfuncV3")
    8209                      .dwattr $C$DW$461, DW_AT_TI_symbol_name("_MfuncV3")
    8210                      .dwattr $C$DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8211                      .dwattr $C$DW$461, DW_AT_accessibility(DW_ACCESS_public)
    8212              
    8213              $C$DW$462       .dwtag  DW_TAG_member
    8214                      .dwattr $C$DW$462, DW_AT_type(*$C$DW$T$37)
    8215                      .dwattr $C$DW$462, DW_AT_name("OutOfPhase")
    8216                      .dwattr $C$DW$462, DW_AT_TI_symbol_name("_OutOfPhase")
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  176

    8217                      .dwattr $C$DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8218                      .dwattr $C$DW$462, DW_AT_accessibility(DW_ACCESS_public)
    8219              
    8220              $C$DW$463       .dwtag  DW_TAG_member
    8221                      .dwattr $C$DW$463, DW_AT_type(*$C$DW$T$24)
    8222                      .dwattr $C$DW$463, DW_AT_name("VphaseA")
    8223                      .dwattr $C$DW$463, DW_AT_TI_symbol_name("_VphaseA")
    8224                      .dwattr $C$DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8225                      .dwattr $C$DW$463, DW_AT_accessibility(DW_ACCESS_public)
    8226              
    8227              $C$DW$464       .dwtag  DW_TAG_member
    8228                      .dwattr $C$DW$464, DW_AT_type(*$C$DW$T$24)
    8229                      .dwattr $C$DW$464, DW_AT_name("VphaseB")
    8230                      .dwattr $C$DW$464, DW_AT_TI_symbol_name("_VphaseB")
    8231                      .dwattr $C$DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8232                      .dwattr $C$DW$464, DW_AT_accessibility(DW_ACCESS_public)
    8233              
    8234              $C$DW$465       .dwtag  DW_TAG_member
    8235                      .dwattr $C$DW$465, DW_AT_type(*$C$DW$T$24)
    8236                      .dwattr $C$DW$465, DW_AT_name("VphaseC")
    8237                      .dwattr $C$DW$465, DW_AT_TI_symbol_name("_VphaseC")
    8238                      .dwattr $C$DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8239                      .dwattr $C$DW$465, DW_AT_accessibility(DW_ACCESS_public)
    8240              
    8241              $C$DW$466       .dwtag  DW_TAG_member
    8242                      .dwattr $C$DW$466, DW_AT_type(*$C$DW$T$24)
    8243                      .dwattr $C$DW$466, DW_AT_name("Valpha")
    8244                      .dwattr $C$DW$466, DW_AT_TI_symbol_name("_Valpha")
    8245                      .dwattr $C$DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8246                      .dwattr $C$DW$466, DW_AT_accessibility(DW_ACCESS_public)
    8247              
    8248              $C$DW$467       .dwtag  DW_TAG_member
    8249                      .dwattr $C$DW$467, DW_AT_type(*$C$DW$T$24)
    8250                      .dwattr $C$DW$467, DW_AT_name("Vbeta")
    8251                      .dwattr $C$DW$467, DW_AT_TI_symbol_name("_Vbeta")
    8252                      .dwattr $C$DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8253                      .dwattr $C$DW$467, DW_AT_accessibility(DW_ACCESS_public)
    8254              
    8255              $C$DW$468       .dwtag  DW_TAG_member
    8256                      .dwattr $C$DW$468, DW_AT_type(*$C$DW$T$24)
    8257                      .dwattr $C$DW$468, DW_AT_name("temp")
    8258                      .dwattr $C$DW$468, DW_AT_TI_symbol_name("_temp")
    8259                      .dwattr $C$DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8260                      .dwattr $C$DW$468, DW_AT_accessibility(DW_ACCESS_public)
    8261              
    8262                      .dwendtag $C$DW$T$42
    8263              
    8264              $C$DW$T$674     .dwtag  DW_TAG_typedef
    8265                      .dwattr $C$DW$T$674, DW_AT_name("PHASEVOLTAGE")
    8266                      .dwattr $C$DW$T$674, DW_AT_type(*$C$DW$T$42)
    8267                      .dwattr $C$DW$T$674, DW_AT_language(DW_LANG_C)
    8268              
    8269              
    8270              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    8271                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x14)
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  177

    8272              $C$DW$469       .dwtag  DW_TAG_member
    8273                      .dwattr $C$DW$469, DW_AT_type(*$C$DW$T$24)
    8274                      .dwattr $C$DW$469, DW_AT_name("ElecTheta")
    8275                      .dwattr $C$DW$469, DW_AT_TI_symbol_name("_ElecTheta")
    8276                      .dwattr $C$DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8277                      .dwattr $C$DW$469, DW_AT_accessibility(DW_ACCESS_public)
    8278              
    8279              $C$DW$470       .dwtag  DW_TAG_member
    8280                      .dwattr $C$DW$470, DW_AT_type(*$C$DW$T$39)
    8281                      .dwattr $C$DW$470, DW_AT_name("DirectionQep")
    8282                      .dwattr $C$DW$470, DW_AT_TI_symbol_name("_DirectionQep")
    8283                      .dwattr $C$DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8284                      .dwattr $C$DW$470, DW_AT_accessibility(DW_ACCESS_public)
    8285              
    8286              $C$DW$471       .dwtag  DW_TAG_member
    8287                      .dwattr $C$DW$471, DW_AT_type(*$C$DW$T$24)
    8288                      .dwattr $C$DW$471, DW_AT_name("OldElecTheta")
    8289                      .dwattr $C$DW$471, DW_AT_TI_symbol_name("_OldElecTheta")
    8290                      .dwattr $C$DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8291                      .dwattr $C$DW$471, DW_AT_accessibility(DW_ACCESS_public)
    8292              
    8293              $C$DW$472       .dwtag  DW_TAG_member
    8294                      .dwattr $C$DW$472, DW_AT_type(*$C$DW$T$24)
    8295                      .dwattr $C$DW$472, DW_AT_name("Speed")
    8296                      .dwattr $C$DW$472, DW_AT_TI_symbol_name("_Speed")
    8297                      .dwattr $C$DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8298                      .dwattr $C$DW$472, DW_AT_accessibility(DW_ACCESS_public)
    8299              
    8300              $C$DW$473       .dwtag  DW_TAG_member
    8301                      .dwattr $C$DW$473, DW_AT_type(*$C$DW$T$39)
    8302                      .dwattr $C$DW$473, DW_AT_name("BaseRpm")
    8303                      .dwattr $C$DW$473, DW_AT_TI_symbol_name("_BaseRpm")
    8304                      .dwattr $C$DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8305                      .dwattr $C$DW$473, DW_AT_accessibility(DW_ACCESS_public)
    8306              
    8307              $C$DW$474       .dwtag  DW_TAG_member
    8308                      .dwattr $C$DW$474, DW_AT_type(*$C$DW$T$43)
    8309                      .dwattr $C$DW$474, DW_AT_name("K1")
    8310                      .dwattr $C$DW$474, DW_AT_TI_symbol_name("_K1")
    8311                      .dwattr $C$DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8312                      .dwattr $C$DW$474, DW_AT_accessibility(DW_ACCESS_public)
    8313              
    8314              $C$DW$475       .dwtag  DW_TAG_member
    8315                      .dwattr $C$DW$475, DW_AT_type(*$C$DW$T$24)
    8316                      .dwattr $C$DW$475, DW_AT_name("K2")
    8317                      .dwattr $C$DW$475, DW_AT_TI_symbol_name("_K2")
    8318                      .dwattr $C$DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8319                      .dwattr $C$DW$475, DW_AT_accessibility(DW_ACCESS_public)
    8320              
    8321              $C$DW$476       .dwtag  DW_TAG_member
    8322                      .dwattr $C$DW$476, DW_AT_type(*$C$DW$T$24)
    8323                      .dwattr $C$DW$476, DW_AT_name("K3")
    8324                      .dwattr $C$DW$476, DW_AT_TI_symbol_name("_K3")
    8325                      .dwattr $C$DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8326                      .dwattr $C$DW$476, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  178

    8327              
    8328              $C$DW$477       .dwtag  DW_TAG_member
    8329                      .dwattr $C$DW$477, DW_AT_type(*$C$DW$T$44)
    8330                      .dwattr $C$DW$477, DW_AT_name("SpeedRpm")
    8331                      .dwattr $C$DW$477, DW_AT_TI_symbol_name("_SpeedRpm")
    8332                      .dwattr $C$DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8333                      .dwattr $C$DW$477, DW_AT_accessibility(DW_ACCESS_public)
    8334              
    8335              $C$DW$478       .dwtag  DW_TAG_member
    8336                      .dwattr $C$DW$478, DW_AT_type(*$C$DW$T$24)
    8337                      .dwattr $C$DW$478, DW_AT_name("Tmp")
    8338                      .dwattr $C$DW$478, DW_AT_TI_symbol_name("_Tmp")
    8339                      .dwattr $C$DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    8340                      .dwattr $C$DW$478, DW_AT_accessibility(DW_ACCESS_public)
    8341              
    8342                      .dwendtag $C$DW$T$45
    8343              
    8344              $C$DW$T$675     .dwtag  DW_TAG_typedef
    8345                      .dwattr $C$DW$T$675, DW_AT_name("SPEED_MEAS_QEP")
    8346                      .dwattr $C$DW$T$675, DW_AT_type(*$C$DW$T$45)
    8347                      .dwattr $C$DW$T$675, DW_AT_language(DW_LANG_C)
    8348              
    8349              
    8350              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    8351                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x12)
    8352              $C$DW$479       .dwtag  DW_TAG_member
    8353                      .dwattr $C$DW$479, DW_AT_type(*$C$DW$T$19)
    8354                      .dwattr $C$DW$479, DW_AT_name("ElecTheta")
    8355                      .dwattr $C$DW$479, DW_AT_TI_symbol_name("_ElecTheta")
    8356                      .dwattr $C$DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8357                      .dwattr $C$DW$479, DW_AT_accessibility(DW_ACCESS_public)
    8358              
    8359              $C$DW$480       .dwtag  DW_TAG_member
    8360                      .dwattr $C$DW$480, DW_AT_type(*$C$DW$T$19)
    8361                      .dwattr $C$DW$480, DW_AT_name("MechTheta")
    8362                      .dwattr $C$DW$480, DW_AT_TI_symbol_name("_MechTheta")
    8363                      .dwattr $C$DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8364                      .dwattr $C$DW$480, DW_AT_accessibility(DW_ACCESS_public)
    8365              
    8366              $C$DW$481       .dwtag  DW_TAG_member
    8367                      .dwattr $C$DW$481, DW_AT_type(*$C$DW$T$37)
    8368                      .dwattr $C$DW$481, DW_AT_name("DirectionQep")
    8369                      .dwattr $C$DW$481, DW_AT_TI_symbol_name("_DirectionQep")
    8370                      .dwattr $C$DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8371                      .dwattr $C$DW$481, DW_AT_accessibility(DW_ACCESS_public)
    8372              
    8373              $C$DW$482       .dwtag  DW_TAG_member
    8374                      .dwattr $C$DW$482, DW_AT_type(*$C$DW$T$37)
    8375                      .dwattr $C$DW$482, DW_AT_name("QepPeriod")
    8376                      .dwattr $C$DW$482, DW_AT_TI_symbol_name("_QepPeriod")
    8377                      .dwattr $C$DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    8378                      .dwattr $C$DW$482, DW_AT_accessibility(DW_ACCESS_public)
    8379              
    8380              $C$DW$483       .dwtag  DW_TAG_member
    8381                      .dwattr $C$DW$483, DW_AT_type(*$C$DW$T$39)
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  179

    8382                      .dwattr $C$DW$483, DW_AT_name("QepCountIndex")
    8383                      .dwattr $C$DW$483, DW_AT_TI_symbol_name("_QepCountIndex")
    8384                      .dwattr $C$DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8385                      .dwattr $C$DW$483, DW_AT_accessibility(DW_ACCESS_public)
    8386              
    8387              $C$DW$484       .dwtag  DW_TAG_member
    8388                      .dwattr $C$DW$484, DW_AT_type(*$C$DW$T$44)
    8389                      .dwattr $C$DW$484, DW_AT_name("RawTheta")
    8390                      .dwattr $C$DW$484, DW_AT_TI_symbol_name("_RawTheta")
    8391                      .dwattr $C$DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8392                      .dwattr $C$DW$484, DW_AT_accessibility(DW_ACCESS_public)
    8393              
    8394              $C$DW$485       .dwtag  DW_TAG_member
    8395                      .dwattr $C$DW$485, DW_AT_type(*$C$DW$T$19)
    8396                      .dwattr $C$DW$485, DW_AT_name("MechScaler")
    8397                      .dwattr $C$DW$485, DW_AT_TI_symbol_name("_MechScaler")
    8398                      .dwattr $C$DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8399                      .dwattr $C$DW$485, DW_AT_accessibility(DW_ACCESS_public)
    8400              
    8401              $C$DW$486       .dwtag  DW_TAG_member
    8402                      .dwattr $C$DW$486, DW_AT_type(*$C$DW$T$37)
    8403                      .dwattr $C$DW$486, DW_AT_name("LineEncoder")
    8404                      .dwattr $C$DW$486, DW_AT_TI_symbol_name("_LineEncoder")
    8405                      .dwattr $C$DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8406                      .dwattr $C$DW$486, DW_AT_accessibility(DW_ACCESS_public)
    8407              
    8408              $C$DW$487       .dwtag  DW_TAG_member
    8409                      .dwattr $C$DW$487, DW_AT_type(*$C$DW$T$37)
    8410                      .dwattr $C$DW$487, DW_AT_name("PolePairs")
    8411                      .dwattr $C$DW$487, DW_AT_TI_symbol_name("_PolePairs")
    8412                      .dwattr $C$DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    8413                      .dwattr $C$DW$487, DW_AT_accessibility(DW_ACCESS_public)
    8414              
    8415              $C$DW$488       .dwtag  DW_TAG_member
    8416                      .dwattr $C$DW$488, DW_AT_type(*$C$DW$T$44)
    8417                      .dwattr $C$DW$488, DW_AT_name("CalibratedAngle")
    8418                      .dwattr $C$DW$488, DW_AT_TI_symbol_name("_CalibratedAngle")
    8419                      .dwattr $C$DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8420                      .dwattr $C$DW$488, DW_AT_accessibility(DW_ACCESS_public)
    8421              
    8422              $C$DW$489       .dwtag  DW_TAG_member
    8423                      .dwattr $C$DW$489, DW_AT_type(*$C$DW$T$37)
    8424                      .dwattr $C$DW$489, DW_AT_name("IndexSyncFlag")
    8425                      .dwattr $C$DW$489, DW_AT_TI_symbol_name("_IndexSyncFlag")
    8426                      .dwattr $C$DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8427                      .dwattr $C$DW$489, DW_AT_accessibility(DW_ACCESS_public)
    8428              
    8429                      .dwendtag $C$DW$T$46
    8430              
    8431              $C$DW$T$676     .dwtag  DW_TAG_typedef
    8432                      .dwattr $C$DW$T$676, DW_AT_name("QEP")
    8433                      .dwattr $C$DW$T$676, DW_AT_type(*$C$DW$T$46)
    8434                      .dwattr $C$DW$T$676, DW_AT_language(DW_LANG_C)
    8435              
    8436              
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  180

    8437              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    8438                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x10)
    8439              $C$DW$490       .dwtag  DW_TAG_member
    8440                      .dwattr $C$DW$490, DW_AT_type(*$C$DW$T$24)
    8441                      .dwattr $C$DW$490, DW_AT_name("ElecTheta")
    8442                      .dwattr $C$DW$490, DW_AT_TI_symbol_name("_ElecTheta")
    8443                      .dwattr $C$DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8444                      .dwattr $C$DW$490, DW_AT_accessibility(DW_ACCESS_public)
    8445              
    8446              $C$DW$491       .dwtag  DW_TAG_member
    8447                      .dwattr $C$DW$491, DW_AT_type(*$C$DW$T$24)
    8448                      .dwattr $C$DW$491, DW_AT_name("MechTheta")
    8449                      .dwattr $C$DW$491, DW_AT_TI_symbol_name("_MechTheta")
    8450                      .dwattr $C$DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8451                      .dwattr $C$DW$491, DW_AT_accessibility(DW_ACCESS_public)
    8452              
    8453              $C$DW$492       .dwtag  DW_TAG_member
    8454                      .dwattr $C$DW$492, DW_AT_type(*$C$DW$T$24)
    8455                      .dwattr $C$DW$492, DW_AT_name("RawTheta")
    8456                      .dwattr $C$DW$492, DW_AT_TI_symbol_name("_RawTheta")
    8457                      .dwattr $C$DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8458                      .dwattr $C$DW$492, DW_AT_accessibility(DW_ACCESS_public)
    8459              
    8460              $C$DW$493       .dwtag  DW_TAG_member
    8461                      .dwattr $C$DW$493, DW_AT_type(*$C$DW$T$24)
    8462                      .dwattr $C$DW$493, DW_AT_name("Speed")
    8463                      .dwattr $C$DW$493, DW_AT_TI_symbol_name("_Speed")
    8464                      .dwattr $C$DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8465                      .dwattr $C$DW$493, DW_AT_accessibility(DW_ACCESS_public)
    8466              
    8467              $C$DW$494       .dwtag  DW_TAG_member
    8468                      .dwattr $C$DW$494, DW_AT_type(*$C$DW$T$24)
    8469                      .dwattr $C$DW$494, DW_AT_name("InitTheta")
    8470                      .dwattr $C$DW$494, DW_AT_TI_symbol_name("_InitTheta")
    8471                      .dwattr $C$DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8472                      .dwattr $C$DW$494, DW_AT_accessibility(DW_ACCESS_public)
    8473              
    8474              $C$DW$495       .dwtag  DW_TAG_member
    8475                      .dwattr $C$DW$495, DW_AT_type(*$C$DW$T$24)
    8476                      .dwattr $C$DW$495, DW_AT_name("MechScaler")
    8477                      .dwattr $C$DW$495, DW_AT_TI_symbol_name("_MechScaler")
    8478                      .dwattr $C$DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8479                      .dwattr $C$DW$495, DW_AT_accessibility(DW_ACCESS_public)
    8480              
    8481              $C$DW$496       .dwtag  DW_TAG_member
    8482                      .dwattr $C$DW$496, DW_AT_type(*$C$DW$T$24)
    8483                      .dwattr $C$DW$496, DW_AT_name("StepsPerTurn")
    8484                      .dwattr $C$DW$496, DW_AT_TI_symbol_name("_StepsPerTurn")
    8485                      .dwattr $C$DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8486                      .dwattr $C$DW$496, DW_AT_accessibility(DW_ACCESS_public)
    8487              
    8488              $C$DW$497       .dwtag  DW_TAG_member
    8489                      .dwattr $C$DW$497, DW_AT_type(*$C$DW$T$37)
    8490                      .dwattr $C$DW$497, DW_AT_name("PolePairs")
    8491                      .dwattr $C$DW$497, DW_AT_TI_symbol_name("_PolePairs")
TMS320C2000 Assembler PC v21.6.0 Sun Jan 23 21:55:03 2022

Copyright (c) 1996-2018 Texas Instruments Incorporated
IDDK_MuratV3.asm                                                     PAGE  181

    8492                      .dwattr $C$DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8493                      .dwattr $C$DW$497, DW_AT_accessibility(DW_ACCESS_public)
    8494              
    8495                      .dwendtag $C$DW$T$47
    8496              
    8497              $C$DW$T$678     .dwtag  DW_TAG_typedef
    8498                      .dwattr $C$DW$T$678, DW_AT_name("RESOLVER")
    8499                      .dwattr $C$DW$T$678, DW_AT_type(*$C$DW$T$47)
    8500                      .dwattr $C$DW$T$678, DW_AT_language(DW_LANG_C)
    8501              
    8502              $C$DW$498       .dwtag  DW_TAG_TI_far_type
    8503                      .dwattr $C$DW$498, DW_AT_type(*$C$DW$T$678)
    8504              
    8505              $C$DW$T$679     .dwtag  DW_TAG_volatile_type
    8506                      .dwattr $C$DW$T$679, DW_AT_type(*$C$DW$498)
    8507              
    8508              
    8509              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    8510                      .dwattr $C$DW$T$48, DW_AT_name("ADCBURSTCTL_BITS")
    8511                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    8512              $C$DW$499       .dwtag  DW_TAG_member
    8513                      .dwattr $C$DW$499, DW_AT_type(*$C$DW$T$37)
    8514                      .dwattr $C$DW$499, DW_AT_name("BURSTTRIGSEL")
    8515                      .dwattr $C$DW$499, DW_AT_TI_symbol_name("_BURSTTRIGSEL")
    8516                      .dwattr $C$DW$499, DW_AT_bit_offset(0x0a)
    8517                      .dwattr $C$DW$499, DW_AT_bit_size(0x06)
    8518                      .dwattr $C$DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8519                      .dwattr $C$DW$499, DW_AT_accessibility(DW_ACCESS_public)
    8520              
    8521              $C$DW$500       .dwtag  DW_TAG_member
    8522                      .dwattr $C$DW$500, DW_AT_type(*$C$DW$T$37)
    8523                      .dwattr $C$DW$500, DW_AT_name("rsvd1")
    8524                      .dwattr $C$DW$500, DW_AT_TI_symbol_name("_rsvd1")
    8525                      .dwattr $C$DW$500, DW_AT_bit_offset(0x08)
    8526                      .dwattr $C$DW$500, DW_AT_bit_size(0x02)
    8527                      .dwattr $C$DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8528                      .dwattr $C$DW$500, DW_AT_accessibility(DW_ACCESS_public)
    8529              
    8530              $C$DW$501       .dwtag  DW_TAG_member
    8531                      .dwattr $C$DW$501, DW_AT_type(*$C$DW$T$37)
    8532                      .dwattr $C$DW$501, DW_AT_name("BURSTSIZE")
